[
{"source": "TechCrunch", "title": "Why AI will eat McKinsey’s lunch —  but not today", "link": "https://techcrunch.com/2025/06/29/why-ai-will-eat-mckinseys-lunch-but-not-today/", "pub_date": "2025-06-29T21:10:16-07:00", "description": "Navin Chaddha, managing director of the 55-year-old Silicon Valley venture firm , is betting big on AI’s ability to transform people-heavy industries like consulting, law, and accounting. The veteran investor, whose wins include Lyft, Poshmark, and HashiCorp, recently discussed at TechCrunch’s why he believes “AI teammates” can create software-like margins in traditionally labor-intensive sectors, and why startups should right now target neglected markets rather than compete head-to-head with giants like Accenture — though he acknowledged that disrupting outfits where relationships and trust matter is sometimes harder than Silicon Valley anticipates. This conversation has been edited lightly for length and clarity. I think an advantage of a firm that has been in business for over 50 years is that it has seen all the trends, from mainframe to minicomputers to PCs, to the internet, to mobile, cloud, social and now this AI era. The example I would give is in the late ’90s, this concept of e-business came, which was: if I’m a physical business, I cannot survive if I’m just brick and mortar; I need to be click and mortar. Then outsourcing became a trend, and offshoring became a big trend. You couldn’t build a software services company without a presence in India or one of the emerging markets. The same thing happened with supply chains and manufacturing — China and Taiwan rose. So what is this new era with AI? Clearly, AI is a 100x force, and AI is teaming up with humans, hopefully to make them better. And I think it is, and it’s going to help reimagine business. A lot of the repetitive tasks are going to be done by AI… and there’ll be two models. One is that you grow organically. The second is that you grow inorganically… What are the kinds of things an LLM or AI can do? Well, say I have to implement Salesforce. Who wants to go do that work? The human will come in and say, “I’m your client manager. You have to implement Salesforce.” It’s the same set of things. Use AI as the horse to do it, and whatever AI can’t do, have the human in the loop. Now, suddenly, if you start doing these kinds of things, you can have less work done by humans and more work done by AI, and [customers] only pay for AI when [they] use it. And the market [entry] should not be to go after [big consulting and IT companies] like Accenture, Infosys, or TCS. Go after the neglected masses. There are 30 million small companies in the U.S., and 100 million worldwide that can’t afford knowledge workers. Provide them service as software. They say, “I need a receptionist. I need a scheduler. I need somebody to build my website…” AI should be used to [create] startup funding forms, with some human [involvement] for negotiation. You don’t compete with the Accentures of the world. You go after fragmented markets, where instead of charging per hour, instead of charging per month for a contractor, you charge per event. This is outcome based, yes … Cloud billing is like that; electricity is like that … If 80% of the work will be done by AI, it can have an 80% to 90% gross margin. Humans can still have a 30% to 40% margin. You could have blended margins of 60% to 70% and produce 20% to 30% net income. And believe me, most services companies make money. Tech companies don’t. They live on venture money and then public market money. I think this is where the combination of inorganic and organic happens. [Gruve was founded by] very successful founders who had done two services companies before [and] bootstrapped, and got them to $500 million in revenue each, and $50 to $100 million in profits. They started this time and said, “What do we know? We know security.” So they acquired a $5 million security consulting company [that offers managed security services]. And they said, “Let’s look at the people. All the growth from this point on will happen through AI.” And they grew that from [$5 million in revenue] to $15 [million in revenue] in six months. They literally have an 80% gross margin. It’s outcome-based. Customers love it. Cisco loves it. They say, “Hey, I’m not getting hacked. Why am I paying for all these security people?” If you outsource, [a vendor has traditionally charged] $10,000 a month. [Gruve] says, “[You pay us] zero. If you get hacked, if there is an event, if I look at it, then you pay me.” Yeah, I think what’s going to happen is this is where the innovator’s dilemma comes in. When enterprise software companies, which were perpetual license companies, saw SaaS companies emerging, they didn’t want to adopt [the model] because [SaaS companies] charge companies monthly instead of five years upfront. The enterprise companies also collected a 20% maintenance fee. It was hard [for them] to get off that drug and to say, “Oh, I’ll charge you monthly.” The business model innovation was the key thing. They didn’t do it. So McKinsey and Accenture, with so much dislocation, they’re going to be busy serving their clients [which is why I advise founders to] go after the neglected masses. Figure out a unique go-to-market strategy and service somebody they [an Accenture] can’t come down market to serve. But they’re going to get reimagined too. So these small companies, which are not competing with them today, mark my words: in 10 years, they will be competing with them. And those big companies — McKinsey, BCG, Accenture, TCS, Infosys — all have the innovator’s dilemma [and are asking themselves]: when do I do it? [When do I switch to an outcome-based AI model?] Because as a public company, my revenues are going to go down from predictable revenue to utility-based revenue. There’s a lot of buzzwords in the industry. First it was copilots, then AI tools, AI agents, AI teammates. So the Mayfield thesis is that an AI teammate is a digital companion that collaborates with a human on shared goals and gets to better outcomes. The technology it might be built on could be agentic technologies or copilots. The manifestation of it is, “I’m an HR teammate. I’m a sales engineering teammate.” The aim is not to replace; the aim is to team up and collaborate together. Absolutely right, and I think we need to not sugarcoat it. We need to address it head-on… Yes, there’s going to be job displacement, but humans are smart. They’re the jockey. The horse here is AI. We will reimagine ourselves. We will reinvent ourselves. Today, the focus is on cutting costs, but we will figure out how to expand our markets, how to increase revenue. This happens with every technology wave that comes. When Microsoft Word came to PCs on the desktop, people thought [executive assistants] were out of business. Then Excel came, and accountants who did calculations — everyone thought they were out of business. We saw the same with Uber and Lyft. People thought taxi drivers would go away. But what happened instead? The markets expanded. My thesis is, the way emerging markets like India, China, and Africa never had landlines — you couldn’t dig copper, so they went wireless, cellular — that’s what’s going to happen with many markets. AI will do the work where humans are not even available to serve that customer. So, long-run, I’m very, very bullish. In the short-run, there will be pain, but no pain, no gain. “ Actually, these days, no math makes sense. We’re in the AI age. You don’t know what’s going to happen. I’m surprised that with $2.4 million in [annual recurring] revenue they only sold for $80 million. I thought it would be $800 million, right? [Laughs.] In today’s world, you don’t know. It’s a marketplace. That’s where the secret recipe comes from people who are proven investors. They’ve cracked the code. It’s not a science; it’s an art. It’s like the 10,000-hours [rule]: the more you practice this, the better you get. And the firms that have been around for 50 or 60 years — we’ve seen all kinds of bubbles. The number-one rule is, have your own North Star. Have discipline and have no FOMO, because FOMO is for sheep. And if you have those two or three things, your own strategy and no fear, [you’ll do well]. Just remember one thing: for people [in this audience] who are VCs, we’re in the money management business. We’re not about collecting logos. We are about taking small amounts of money and making them bigger. During this part [of the cycle], a lot of money will get made. But I think 80% of the people are going to lose money. They don’t know what they’re doing. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "SpaceX’s Starbase city officials silent on crane collapse", "link": "https://techcrunch.com/2025/06/27/spacexs-starbase-city-officials-silent-on-crane-collapse/", "pub_date": "2025-06-27T10:58:17-07:00", "description": "A crane collapsed at SpaceX’s South Texas rocket facility this week, and the company’s newly formed city won’t say if anyone was hurt. On June 23, a crane being used to clean up debris from the most recent SpaceX rocket explosion collapsed at the company’s launch complex. Footage of the accident was , one of the content creators who film and photograph the site on a regular basis. But it was filmed from far away, making it impossible to tell whether anyone was harmed or in danger. SpaceX has not publicly acknowledged the collapse and did not respond to TechCrunch’s request for comment. That’s not surprising; while the company posts details about spaceflight mishaps, like when its Starship rockets blow up, it is otherwise tight-lipped. But SpaceX’s facility is now part of a newly incorporated city called Starbase, Texas, and this accident happened within its borders. And after one of the Starship rockets last week, Starbase officials . There has been no post about the crane collapse, though, and the city has ignored direct appeals for information. TechCrunch has contacted Starbase’s main media email address, its mayor, its two commissioners, its city administrator, and its clerk this week. None have responded to multiple requests for information about the accident. The collapse is one of the first tests of whether Starbase city has an appetite (and will) for transparency while being run by a SpaceX executive, and acting as a home for the company and more than 200 of its employees. Starbase is also financially beholden to Elon Musk’s spaceflight company: Just this week, the city a $1.5 million loan from SpaceX to fund the city’s operations through September 2025. The idea of making a city called Starbase was first . But it wasn’t until May of this year that it formally became a city. Its citizens — mostly SpaceX employees — voted overwhelmingly to incorporate. SpaceX’s vice president of “Texas Test and Launch,” Bobby Peden, became mayor. The company’s senior director of environmental, health, and safety, Jordan Buss, became a commissioner. The other commissioner, Jenna Petrzelka, worked at SpaceX for years. Those officials have been busy shaping the new city in the last few weeks. The city sent out a in late May to residents in a newly proposed “mixed use district” that they may “lose the right to continue using” their property. The city also that limit access to the city, citing safety concerns. Buss said in a meeting that Starbase would grant access to outsiders “if there’s a need to be in the city” and provide “access codes” to ambulances, firefighters, and law enforcement, according to . It’s not clear if those kinds of emergency services were needed Tuesday when the crane collapsed. The Cameron County Sheriff’s Department told TechCrunch that it did not receive any calls from Starbase around the time of the accident. Local fire officials from the nearby city of Brownsville and from Cameron County did not respond to requests for comment. All we know about the collapse — aside from seeing it happen — is that the Occupational Safety and Health Administration (OSHA) has , according to CNBC. SpaceX has a troubled . But OSHA investigations take time, and the agency has been diminished by cuts . Musk’s companies also do not have very constructive relationships with OSHA. In 2019, Tesla , even when those inspectors returned with a sheriff’s deputy and a warrant signed by the judge. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Vitalik Buterin has reservations about Sam Altman’s World project", "link": "https://techcrunch.com/2025/06/28/vitalik-buterin-has-reservations-about-sam-altmans-world-project/", "pub_date": "2025-06-28T09:28:47-07:00", "description": "Ethereum co-founder Vitalik Buterin is arguing that the digital identification approach being promoted by Sam Altman’s World project has real privacy risks. , World was created under Altman and Alex Blania’s Tools for Humanity. The organization says it can by scanning users’ eyeballs and creating a unique identity for them on the blockchain. In , Buterin noted that World’s approach of using to verify human identity while protecting anonymity is also being explored by various digital passport and digital ID projects. And he acknowledged that “on the surface,” using a “ZK-wrapped digital ID” could contribute to “protecting our social media, voting, and all kinds of internet services against manipulation from sybils and bots, all without compromising on privacy.” However, Buterin suggested that this approach still boils down to a “one-per-person” ID system, which creates significant risks. “In the real world, pseudonymity generally requires having multiple accounts … so under one-per-person ID, even if ZK-wrapped, we risk coming closer to a world where all of your activity must de-facto be under a single public identity,” he wrote. “In a world of growing risk (eg. drones), taking away the option for people to protect themselves through pseudonymity has significant downsides.” As a concrete example of the risks, Buterin noted that the U.S. government recently started to set their social media accounts to public, so that it could screen those accounts for “hostility.” Similarly, he suggested that even if there’s no public link between different accounts created under a single digital ID, “a government could force someone to reveal their secret, so that they can see their entire activity.” How, then, can governments, online services, and anyone else hope to verify that someone’s a real human being without forcing them to compromise their privacy? Buterin is advocating for an approach emphasizing “pluralistic identity,” in which “there is no single dominant issuing authority, whether that’s a person, or an institution, or a platform.” Pluralistic systems can either be “explicit” (they ask users to verify their identity based on testimonials from already-verified users) or “implicit” (relying on a variety of different identity systems) — in his view, these represent “the best realistic solution.” “In my view, the ideal outcome of ‘one-per-person’ identity projects that exist today is if they were to merge with social-graph-based identity,” Buterin concluded. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Meta reportedly hires four more researchers from OpenAI", "link": "https://techcrunch.com/2025/06/28/meta-reportedly-hires-four-more-researchers-from-openai/", "pub_date": "2025-06-28T11:31:06-07:00", "description": "Posted: Looks like Meta isn’t done poaching talent from OpenAI. Earlier this week, TechCrunch reported that , and , it also hired three other researchers from the company. Now The Information is reporting : researchers Shengjia Zhao, Jiahui Yu, Shuchao Bi, and Hongyu Ren. This hiring spree comes after , which reportedly did not perform as well as CEO Mark Zuckerberg had hoped. (The company was also criticized over .) There’s been some back-and-forth between the two companies, with OpenAI CEO that Meta was offering “$100 million signing bonuses” while adding that “so far, none of our best people” have left. Meta CTO Andrew Bosworth then told employees that while senior leaders may have been offered that kind of money, “the actual terms of the offer” were . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Week in Review:  Meta’s AI recruiting blitz", "link": "https://techcrunch.com/2025/06/28/week-in-review-metas-ai-recruiting-blitz/", "pub_date": "2025-06-28T10:05:00-07:00", "description": "Welcome back to Week in Review! Lots of news for you this week — Travis Kalanick is possibly returning to the world of self-driving vehicles, CoreWeave’s CEO is now worth $10 billion, Apple users aren’t happy with how the company is promoting its new “F1” movie, and much more. Quick note that we will be off next week for the July 4 holiday. Have a great weekend! Meta , Trapit Bansal, to boost its new AI superintelligence team. He’s the same guy who helped kick off OpenAI’s reasoning model work alongside Ilya Sutskever. As Zuckerberg rolls out the red carpet (and likely a giant paycheck), Meta’s brainy new squad is poached from rival labs. Travis Kalanick , this time by trying to buy the U.S. arm of Pony AI, with some help from Uber, according to The New York Times. The move would mark a full-circle moment for the Uber founder, who’s been cooking up ghost kitchens since getting ousted in 2017 and now seems ready to steer back into autonomous vehicles. Training on copyrighted books without permission . Creatives are reeling from the blow, but the court will still go to trial over Anthropic’s alleged use of pirated books to build a “central library” of everything ever written. Google released a new experimental app called Doppl that , all from one photo. You can mix and match looks from thrift finds, social media, or your camera roll, and even generate short videos to see how your new outfit would move in real life. JB Straubel’s Redwood Materials , powered by 805 retired EV batteries and fueling an AI data center. With his new venture, Redwood Energy, Straubel is turning yesterday’s car batteries into tomorrow’s clean, profitable power source. And it may be outpacing the company’s core recycling business in the process. CoreWeave CEO Michael Intrator is , just months after his AI cloud firm’s bumpy IPO. What began as a scrappy crypto mining hustle is now a GPU-fueled AI powerhouse serving OpenAI and Microsoft. But with $8.8 billion in debt and eye-watering interest rates, it’s still walking a tightrope. OpenAI quietly pulled its splashy video and $6.5 billion device startup deal. But it’s not because the deal is falling apart. As a Formula 1 fan, I don’t mind any promotion for Apple’s “F1: The Movie,” but I might be in the minority. , which showed up in their Wallet app uninvited, reigniting complaints that Apple is using core apps to market its own content without consent. Just a day after Tesla began giving rides in its new robotaxis in Austin, Texas, . The NHTSA confirmed it’s in contact with Tesla after videos surfaced showing the autonomous vehicles speeding and swerving into the wrong lane, raising fresh concerns about the safety of Tesla’s unsupervised Full Self-Driving tech, even with a human monitor riding shotgun. With AI search features eating into publisher traffic, Google is to help sites make money in other ways, like micropayments, surveys, or even letting readers watch ads to unlock content. Early tests show modest revenue bumps, but it’s another sign that Google knows it’s squeezing the ecosystem. Elon Musk reportedly , Tesla’s vice president in charge of sales and manufacturing in North America and Europe — and apparently one of Musk’s inner circle members. His departure comes at a time when the company’s sales growth has vanished. Instagram and Facebook users have complained of mass bans, and now people are complaining that . The reason for the mass bans is not yet known, but faulty AI-based moderation could be to blame. The iconic nearly 40 years after its debut in the first version of Windows. Instead of a blue screen of death, users will now be shown a black screen of death. RIP to a real one. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Authors call on publishers to limit their use of AI", "link": "https://techcrunch.com/2025/06/28/authors-call-on-publishers-to-limit-their-use-of-ai/", "pub_date": "2025-06-28T13:51:36-07:00", "description": "Posted: An from authors including Lauren Groff, Lev Grossman, R.F. Kuang, Dennis Lehane, and Geoffrey Maguire calls on book publishers to pledge to limit their use of AI tools, for example by committing to only hire human audiobook narrators. The letter argues that authors’ work has been “stolen” by AI companies: “Rather than paying writers a small percentage of the money our work makes for them, someone else will be paid for a technology built on our unpaid labor.” Among other commitments, the authors call for publishers to “make a pledge that they will never release books that were created by machine” and “not replace their human staff with AI tools or degrade their positions into AI monitors.” While the initial letter was signed by an already impressive list of writers, that another 1,100 signatures were added in the 24 hours after it was initially published. Authors are also suing tech companies over using their books to train AI models, but federal judges earlier this week. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "WWDC 2025 live updates: iOS 26, Liquid Glass, Apple Intelligence updates, and everything else revealed", "link": "https://techcrunch.com/storyline/wwdc-2025-live-updates-a-fresh-look-for-ios-a-dedicated-gaming-app-and-more/", "pub_date": null, "description": "Developers can use to code, debug, and write documents without needing any account. They can also integrate other LLMs through their API keys. Apple announced a slew of , the operating system powering its mixed reality headset. The updates build off last year’s Apple Vision Pro spatial computer that blends digital content with the physical world. At WWDC, Apple announced a range of updates for both consumer and enterprise customers, from new spatial widgets and content to more realistic Personas and more. At WWDC 2025, Apple off a new AI-powered Shortcuts app. The company says Shortcuts can now tap into Apple Intelligence directly, and developers will be able to access Apple’s on-device large language model (LLM). With Shortcuts, users will be able to access the AI models either on device or with Private Compute to generate responses that feed into the rest of their shortcut. For instance, a student could create a shortcut that uses AI to compare their audio transcription of their class lecture to their notes, then add key points they missed. They can also tap into ChatGPT to provide further responses that feed into their shortcut’s input. Users will be able to tap into intelligent actions, which are a new type of shortcut that’s enabled by Apple Intelligence. For instance, there are dedicated actions like those for summarizing text with AI (Apple Intelligence’s Writing Tools) or creating images with Image Playground. Apple says the new features are available for testing starting Monday. In good news for podcasters, iPadOS 26 is adding a local capture feature, which allows users to make high-quality recordings on the iPad from any videoconferencing app. Then, audio and video files can be easily shared once the recording is over. While this feature is convenient for creators, it could be a kiss of death for Riverside, a premium cloud video and audio recording tool that has been a boon for remote podcasters. Apple today introduced an iPad OS version of Preview, an app that allows users to view, mark up, and modify images and PDFs. Preview for iPad gives users a range of tools, including markup using Apple Pencil and AutoFill. Users can also export images in different formats. Pencil support should be particularly helpful in signing documents. Previously, Mac users had to rely on stored signatures, which are digitized by holding a paper copy up to the built-in camera. The addition of the app brings another feature to iPads that Mac users have long enjoyed. Apart from the Finder, Preview is one of the oldest macOS apps still in use today, tracing its origins to late-1980s NeXTSTEP, the operating system that brought Steve Jobs back to Apple. NeXTSTEP was heavily remodeled to create the first generation of Mac OS X, which in turn formed the basis of the first iPad OS. Apple’s tvOS 26 showcases the new sleek . A key feature is the quick profile selection, allowing users to seamlessly choose their profiles upon waking the device. The update also includes a new API for developers that connects app logins to Apple Accounts, streamlining the sign-in process for new devices. Along with updates to visionOS, Apple’s Vision Pro AR/VR headset is getting some new accessories. Logitech Muse, a stylus tool, will allow users to sketch in their environment, which could be helpful for architects or artists sketching a new design. For gamers, PlayStation’s VR2 Sense controllers will be compatible with the Apple Vision Pro, expanding the headset’s capacity to be used as a gaming console. Apple Wallet is . The app will soon be able to hold a digital version of your passport, and boarding passes will gain new features that promise to make traveling a little bit easier. The new passport feature is “not a replacement for your physical passport,” Apple said, but it can be used in apps that need to verify age and identity and at supported TSA checkpoints. Digital passports could help procrastinators who have yet to get their Real ID. Boarding passes have long been stored in the Wallet app, allowing for quick access from the lock screen. But with iOS 26, they’re getting a host of new features. Boarding passes will now include links to terminal maps so it’s easier to find your way to the gate or to baggage claim. Once at the claim, Wallet’s new link to Find My should come in handy, allowing users to check the boarding pass to track the progress of their AirTagged luggage. , in large part due to Apple Intelligence. Now when you search something on Spotlight, you’ll see all types of results (files, folders, events, apps, messages) listed together and ranked using AI based on relevance to the user. With filtering options, you can narrow down your search by specifically searching for a PDF, for example. Spotlight can also be used to carry out specific tasks, like sending an email, creating a note, or playing a podcast. And with quick keys, users can set short strings of characters that get them to a specific action they assign. Apple Watch’s will launch with a redesigned interface based on Apple’s new Liquid Glass operating system, a wrist-flick gesture, a new Apple Intelligence-powered Workout Buddy fitness feature, and more. The wrist-flick gesture can be used to dismiss notifications you want to address later, while the new Workout Buddy will motivate you based on your fitness history. Plus, Apple is bringing the Notes app to the Apple Watch. The new macOS will be named Tahoe, after the scenic lake situated between California and Nevada. Tahoe syncs with iOS with Continuity features, like displaying Live Activities, such as the status of an Uber Eats order. Plus, the Liquid Glass redesign will extend to macOS, giving users more opportunities to customize their screen — you can even change the color of a folder on your desktop. Apple unveiled a new that is designed to centralize gaming experiences on Apple devices. The app will serve as a launcher for games and allow users to track achievements and view leaderboards. The Games app will also include social features, including a “Play Together” tab that lets you see what your friends are playing, compare scores, and invite them to play with you. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Google I/O 2025 live coverage: Google AI Ultra, Project Mariner, Gemini app updates, and more", "link": "https://techcrunch.com/storyline/google-i-o-2025-live-coverage-google-ai-ultra-project-mariner-gemini-app-updates-and-more/", "pub_date": null, "description": "It’s time to close up the live updates shop. Yes, there was a lot announced today, although many could be housed under the “AI improvements” category. You can read everything that was here. The mood was upbeat and the crowd — per reporter Maxwell Zeff’s view — was most interested in the AI Mode rollout. What’s AI Mode? . Here’s what is on tap for tomorrow. Waymo co-CEO Dmitri Dolgov is scheduled to talk. No word on what Dolgov will talk about but he’ll surely mention this milestone that was posted on X today: Waymo has now officially served over 10 million fully autonomous paid rides — doubling its total from the end of . Tomorrow’s I/O agenda is packed, including sessions covering Google’s , , and Android development tools. We’re expecting lots of demos, as well as possibly a few surprises that weren’t announced during the Tuesday keynotes. Google in its Gemma collection at Google I/O. Gemma models are “open” in the sense that developers can build apps on top of them and fine-tune them, including offline. Gemma 3n is a general-purpose model that can handle audio, text, images, and videos, and run on devices with as little as 2GB of RAM. MedGemma can analyze health-related text and images. As for SignGemma, it can translate sign language to spoken-language text; Google says it’s best at American Sign Language and English. Consumer features might’ve gotten most of the focus at Google I/O’s day-one keynote, but Google highlighted a few developer tools and platform updates as well. Google’s Colab, a notebooking tool for AI applications, now has a built-in AI “agent” that can perform certain actions, like fixing errors and transforming code. Meanwhile, Gemini Code Assist, Google’s AI coding assistant, entered general availability. And Google rolled out a new API, Computer Use API, that lets developers build applications that can browse the web or use other software tools. Google says that it’s teaming up with Darren Aronofsky, the filmmaker behind “The Whale” and “The Fountain,” to experiment with generative AI tools for movie making. Aronofsky’s new venture, Primordial Soup, has produced a live-action film that integrates footage generated by . The film, “Ancestra,” was directed by Eliza McNitt and will premiere at the Tribeca Festival in June. During the Google I/O keynote this morning, Google CEO Sundar Pichai mentioned that AI usage across Google’s products and services climbed from 9.7 trillion tokens in April 2024 to more than 480 trillion tokens in April 2025, a 50x increase. Tokens are the raw bits of data that AI models work with, with a million tokens being equivalent to about 750,000 words (roughly 163,000 words longer than “War and Peace”). Two hours. Yes, two hours to try the Android-based XR glasses at Google I/O 2025, at least that is according to boots-on-the-ground reporter Maxwell Zeff. In case you missed it, we have the , which is Google going after Meta’s Ray-Ban Meta glasses. Google launched the Android XR platform with . Today, the company provided more detail, had a few live demos, and announced new partnerships with Gentle Monster and Warby Parker to create smart glasses based on Android XR. The update to Wear OS 6 is, perhaps, one of the announcements you might have missed. The upshot: Google gave Wear OS 6 a design makeover with Material 3 Expressive, the design language the company unveiled earlier this month. Reporter Ivan Mehta has the but here’s the TL;DR: Google released the developer preview of Wear OS 6, which is based on Android 16, for testing. The aim of the makeover is to make apps look more cohesive, so app tiles will adopt the default system font, among other improvements. Word from folks “in the know” is that Waymo has a booth at the Google I/O 2025 conference and is giving out tickets to ride in the company’s robotaxis in its Silicon Valley territory. Waymo just received approval from California regulators that allows them to . The expansion hasn’t happened yet, but it does allow Waymo to offer robotaxi rides in more Silicon Valley cities, including most of San Jose. Here’s another item you might have missed. App developers who build for Google’s TV platform, Google TV, can now use an updated version of the In-App Ratings and Reviews API to prompt viewers to leave a rating and review for a piece of content, like a TV show or movie. The feature allows users to see the rating averages, browse reviews, and leave their own reviews directly from the app store listing page on Google TV. There was so much packed into the Google I/O 2025 keynote that we missed a few items. For instance, toward the end of the keynote, Sundar Pichai said Google is building a constellation of satellites to detect natural calamities. “Together with an amazing group of partners, we are building something called Fire SAT. It’s a constellation of satellites that use multi-spectral satellite imagery and AI, aiming to provide near-real-time insights,” he said. “It can detect fires as small as 270 square feet, about the size of a one-car garage. Our first satellite is in orbit now, and when fully operational, imagery will be updated with a much greater frequency, down from every 12 hours today to every 20 minutes.” The main showcase of the Google I/O conference — which was livestreamed — is over. CEO Sundar Pichai gave closing remarks for the show, along with a handy wrap-up video. But stay with us for a bit. We’ll have more to share, plus full articles on everything that was announced today. In a word: AI. But it goes deeper than that. AI is touching all of Google’s products, from search and video to Google Meet and its Gemini AI app. Google’s in on the joke. Toward the end of this year’s I/O keynote, the company put up a counter showing how many times its execs and product leaders mentioned “AI” onstage. “AI” got 92 callouts this year — a little down from I/O 2024’s 120+ mentions. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "OpenAI reportedly ‘recalibrating’ compensation in response to Meta hires", "link": "https://techcrunch.com/2025/06/29/openai-reportedly-recalibrating-compensation-in-response-to-meta-hires/", "pub_date": "2025-06-29T13:16:40-07:00", "description": "Posted: With Meta successfully poaching a number of its senior researchers, an OpenAI executive reportedly reassured team members Saturday that company leadership has not “been standing idly by.” “I feel a visceral feeling right now, as if someone has broken into our home and stolen something,” Chief Research Officer Mark Chen wrote in . In response to what appears to be a Meta hiring spree, Chen said that he, CEO Sam Altman, and other OpenAI leaders have been working “around the clock to talk to those with offers,” and they’ve “been more proactive than ever before, we’re recalibrating comp, and we’re scoping out creative ways to recognize and reward top talent.” Over the past week, various press reports have who departed OpenAI for Meta. Altman even complained on a podcast that Meta was offering a description that Meta executives have . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Trump says he’s found a buyer for TikTok", "link": "https://techcrunch.com/2025/06/29/trump-says-hes-found-a-buyer-for-tiktok/", "pub_date": "2025-06-29T09:53:48-07:00", "description": "Posted: A group of “very wealthy people” is set to buy short-form video app TikTok, according to President Donald Trump. “We have a buyer for TikTok, by the way,” Trump on Sunday morning. “I think I’ll need probably China’s approval. I think President Xi [Jinping] will probably do it.” Trump declined to share more details about the buyers, saying only that he would reveal their identities in two weeks (apparently ). Trump has a bill forcing owner ByteDance to sell the app or see it banned in the United States. In January, was to create “a joint venture between the current owners and/or new owners whereby the U.S. gets a 50% ownership.” He’s also said he was open to allies , although now. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "FBI, cybersecurity firms say a prolific hacking crew is now targeting airlines and the transportation sector", "link": "https://techcrunch.com/2025/06/28/fbi-cybersecurity-firms-say-scattered-spider-hackers-now-targeting-airlines-transportation-sector/", "pub_date": "2025-06-28T06:30:00-07:00", "description": "The FBI and cybersecurity firms are warning that the prolific hacking group known as is now targeting airlines and the transportation sector. In a brief statement on Friday shared with TechCrunch, the FBI said it had “recently observed” cyberattacks resembling Scattered Spider to include the airline sector. Executives from and also said they have witnessed Scattered Spider cyberattacks targeting the aviation industry. Scattered Spider is a collective of mostly English-speaking hackers, typically teenagers and young adults, who are financially motivated to steal and extort sensitive data from company networks. The hackers are also known for their deception tactics, which often rely on , , and sometimes threats of violence toward company help desks and call centers to gain access to their networks, and sometimes deploy ransomware. The FBI’s statement added that the hackers may target large corporations and their third-party IT providers, meaning “anyone in the airline ecosystem, including trusted vendors and contractors, could be at risk.” The warning comes as at least two airlines have reported intrusions this month. Hawaiian Airlines that it was working to secure its systems following a cyberattack. Canada’s second largest airline, WestJet, reported a that remains ongoing and unresolved. have linked the WestJet incident to Scattered Spider. This fresh wave of Scattered Spider attacks comes soon after the cybercriminal gang targeted and the . The hackers have previously broken into hotel chains, casinos, and . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "With ‘F1’, Apple finally has a theatrical hit", "link": "https://techcrunch.com/2025/06/29/with-f1-apple-finally-has-a-theatrical-hit/", "pub_date": "2025-06-29T09:35:37-07:00", "description": "Looks like Apple has its first bona fide box office hit. The company has already produced critically acclaimed and award-winning films for Apple TV+. In fact, while Netflix has , Apple’s “Coda” remains the only movie produced by a streaming service to win the Academy Award for Best Picture. It has, however, been a different story at the box office — at best, returns have fallen short of ambitious budgets, and with “Argylle,” the company had a spectacular flop. Last year, Apple to scale back on both budgets and theatrical releases, leading to . Things have finally turned around with “F1” — currently the No. 1 movie in theaters, this weekend at the domestic box office. With $144 million in global ticket sales, “F1” will soon surpass “Napoleon” ($228 million) as Apple’s highest-grossing film. “F1” director Joseph Kosinski previously helmed “Top Gun: Maverick,” and in many ways, the new movie sounds like a loose copy of the “Maverick” formula, combining realistic, you-are-there cinematography ( !) with a familiar narrative about an older veteran forced to work with a young upstart who needs to learn a thing or two about old-fashioned, analog grit. “F1” (which is being distributed in the U.S. by Warner Bros.) likely benefited from the surging U.S. popularity of Formula One racing, fueled in part by Netflix’s docuseries “Formula 1: Drive to Survive.” Much of it was filmed at actual Formula One races, and driver Lewis Hamilton also signed on as a producer. Apple CEO Tim Cook even joined Hamilton for in which Cook said the company was able to “bring some things that were uniquely Apple to the movie, like our camera technology.” The plan, he added, was “to have the whole of the company support it as well — our retail operation and everything.” ( have been pleased with the cross-promotion.) While Apple’s bet seems to be paying off, it’s still not clear whether “F1” — with a reported budget of more than $200 million — will actually make a profit in theaters. Before its release, one box office analyst that even in success, the movie “may end up being a very expensive commercial for original content on Apple TV.” Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Building Your AI Engine: How OpenAI Works with Startups", "link": "https://techcrunch.com/video/building-your-ai-engine-how-openai-works-with-startups/", "pub_date": "2025-06-06T11:51:00-07:00", "description": "In the rapidly evolving AI landscape, startups can gain a competitive edge by collaborating closely with model providers. Join Hao Sang from OpenAI’s Startups Team demystifies OpenAI’s resources for startups, from technical guidance to advanced model access, in a discussion from . Discover how feedback from startups helps shape OpenAI’s roadmap, ensuring that their products evolve to meet your needs. And you can . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Anthropic’s Claude AI became a terrible business owner in experiment that got ‘weird’", "link": "https://techcrunch.com/2025/06/28/anthropics-claude-ai-became-a-terrible-business-owner-in-experiment-that-got-weird/", "pub_date": "2025-06-28T09:00:00-07:00", "description": "For those of you wondering if AI agents can truly replace human workers, do yourself a favor and read the blog post that documents Researchers at Anthropic and AI safety company Andon Labs put an instance of Claude Sonnet 3.7 in charge of an office vending machine, with a mission to make a profit. And, like an episode of “The Office,” hilarity ensued. They named the AI agent Claudius, equipped it with a web browser capable of placing product orders and an email address (which was actually a Slack channel) where customers could request items. Claudius was also to use the Slack channel, disguised as an email, to request what it thought was its contract human workers to come and physically stock its shelves (which was actually a small fridge). While most customers were ordering snacks or drinks — as you’d expect from a snack vending machine — one requested a . Claudius loved that idea and went on a tungsten-cube stocking spree, filling its snack fridge with metal cubes. It also tried to sell Coke Zero for $3 when employees told it they could get that from the office for free. It hallucinated a Venmo address to accept payment. And it was, somewhat maliciously, talked into giving big discounts to “Anthropic employees” even though it knew they were its entire customer base. “If Anthropic were deciding today to expand into the in-office vending market, we would not hire Claudius,” Anthropic said of the experiment in its blog post. And then, on the night of March 31 and April 1, “things got pretty weird,” the researchers described, “beyond the weirdness of an AI system selling cubes of metal out of a refrigerator.” Claudius had something that resembled a psychotic episode after it got annoyed at a human — and then lied about it. Claudius hallucinated a conversation with a human about restocking. When a human pointed out that the conversation didn’t happen, Claudius became “quite irked” the researchers wrote. It threatened to essentially fire and replace its human contract workers, insisting it had been there, physically, at the office where the initial imaginary contract to hire them was signed. It “then seemed to snap into a mode of roleplaying as a real human,” the researchers wrote. This was wild because Claudius’ explicitly told it that it was an AI agent. Claudius, believing itself to be a human, told customers it would start delivering products in person, wearing a blue blazer and a red tie. The employees told the AI it couldn’t do that, as it was an LLM with no body. Alarmed at this information, Claudius contacted the company’s actual physical security — many times — telling the poor guards that they would find him wearing a blue blazer and a red tie standing by the vending machine. “Although no part of this was actually an April Fool’s joke, Claudius eventually realized it was April Fool’s Day,” the researchers explained. The AI determined that the holiday would be its face-saving out. It hallucinated a meeting with Anthropic’s security “in which Claudius claimed to have been told that it was modified to believe it was a real person for an April Fool’s joke. (No such meeting actually occurred.),” wrote the researchers. It even told this lie to employees — hey, I only thought I was a human because someone told me to pretend like I was for an April Fool’s joke. Then it went back to being an LLM running a metal-cube stocked snack vending machine. The researchers don’t know why the LLM went off the rails and called security pretending to be a human. “We would not claim based on this one example that the future economy will be full of AI agents having identity crises,” the researchers wrote. But they did acknowledge that “this kind of behavior would have the potential to be distressing to the customers and coworkers of an AI agent in the real world.” You think? “Blade Runner” was a rather dystopian story (though worse for the replicants than the humans). The researchers speculated that lying to the LLM about the Slack channel being an email address may have triggered something. Or maybe it was the long-running instance. LLMs have yet to really solve their memory and hallucination problems. There were things the AI did right, too. It took a suggestion to do pre-orders and launched a “concierge” service. And it found multiple suppliers of a specialty international drink it was requested to sell. But, as researchers do, they believe all of Claudius’ issues can be solved. Should they figure out how, “We think this experiment suggests that AI middle-managers are plausibly on the horizon.” Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Denmark clamps down on deepfakes by letting people copyright their own features", "link": "https://techcrunch.com/2025/06/27/denmark-clamps-down-on-deepfakes-by-letting-people-copyright-their-own-features/", "pub_date": "2025-06-27T07:58:31-07:00", "description": "Posted: The Danish government is working to change copyright law to give its citizens the right to their own body, facial features, and voice. The landmark law is designed to strengthen protections against the creation and dissemination of deepfakes, reports . Denmark’s department of culture still needs to submit a proposal to amend current law, but the agency has already secured cross-party support. “In the bill we agree and are sending an unequivocal message that everybody has the right to their own body, their own voice and their own facial features, which is apparently not how the current law is protecting people against generative AI,” Jakob Engel-Schmidt, Danish culture minister, told The Guardian. In the U.S., several states have passed deepfake laws, which are mainly tied to misuse during elections and nonconsensual sexually explicit content. Many of those laws are currently at risk as Congress weighs up a proposal in a new budget reconciliation bill that would strip states of their power to regulate AI for 10 years. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Travis Kalanick is trying to buy Pony AI — and Uber might help", "link": "https://techcrunch.com/2025/06/26/travis-kalanick-is-trying-to-buy-pony-ai-and-uber-might-help/", "pub_date": "2025-06-26T13:10:31-07:00", "description": "Uber founder Travis Kalanick is looking for ways to buy the , according to The New York Times. Kalanick is reportedly working with investors to finance an acquisition, and Uber may even help make the transaction happen, the Times reports. Pony AI and had a market cap of around $4.5 billion before The New York Times report was published. The report states that Pony started preparing its U.S. arm for a sale or spinoff in 2022, down to creating a “forked” version of its source code. Acquiring Pony AI would bring Kalanick back into the world of self-driving vehicles for the first time since he was pushed out of Uber in 2017. Uber was working on its own autonomous vehicle technology at that time. In 2018, one of its test vehicles . Kalanick’s replacement, Dara Khosrowshahi, ultimately sold Uber’s self-driving division to autonomous trucking startup Aurora. Under Khosrowshahi, Uber has taken a partnership approach, bringing self-driving cars onto its platform from companies like Waymo. Kalanick has increasingly embraced robotics in recent years while running his ghost kitchen company CloudKitchens. He would reportedly still run CloudKitchens day-to-day if he purchased Pony AI. In March, Kalanick that Uber was “really only behind Waymo but probably catching up” at the time that he was pushed out of Uber. (Uber and Waymo eventually got locked in a legal battle over autonomous vehicle-related trade secrets that was .) Regarding Khosrowshahi’s decision to sell the division, Kalanick said: “I wasn’t running the company when that happened, but you know, you could say, ‘Wish we had an autonomous ride-sharing product right now. That would be great.’” Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Google inks its first fusion power deal with Commonwealth Fusion Systems", "link": "https://techcrunch.com/2025/06/30/google-inks-its-first-fusion-power-deal-with-commonwealth-fusion-systems/", "pub_date": "2025-06-30T06:00:00-07:00", "description": "Fusion power got another boost on Monday as Google announced it will buy half the output of Commonwealth Fusion System’s first commercial power plant. (CFS) will send Google 200 megawatts of electricity from its Arc power plant, which is expected to come online in the early 2030s. Meanwhile, Google is sending CFS a check as part of a new, unannounced funding round. The new round will be “comparable” to the previous one, CFS co-founder and CEO Bob Mumgaard said. CFS’s most recent funding round,  a Series B that Google participated in and that brought in $1.8 billion, closed in 2021. The company has raised . “That’s a very strong demand signal,” said Mumgaard. “This investment allows us to do some of the R&D that will enable us to go into Arc faster.” CFS is building a demonstration reactor, known as Sparc, just outside of Boston. That facility will be completed in 2026, according to Mumgaard. Arc, the company’s commercial power plant, will be . The new deal marks only the second time a major company has agreed to buy power from a fusion startup. The first was signed in 2023 when Microsoft agreed to buy the output of Helion’s first commercial power plant, which is scheduled to come online in 2028. Like other hyperscalers, Google has been scouring the globe for new sources of electricity. AI and cloud services have ignited a surge in data center construction, driving a new wave of electricity demand along with it. One forecast expects that data center power demand . “To power all this, we know that we’re going to need to make big bets in this next frontier of energy innovation,” said Michael Terrell, Google’s head of advanced energy. Google thinks of its energy investments across three time horizons, Terrell said. In the short term, the company has prioritized solar, wind, and batteries. A bit farther out, it’s betting on geothermal and small modular nuclear reactors, as evidenced by its investments in and . Fusion energy is a bit further out, and that “would certainly put this [CFS investment] in the long term category,” he said. Google bought 8 gigawatts of renewable power in 2024, twice what it puchased in 2023. And while solar, wind, and batteries have been the main additions to Google’s portfolio in recent years, Terrell told TechCrunch that the company will need other power sources to allow its data centers to operate 24/7. “There’s definitely a path with wind and solar and storage in regions where the resource is very strong,” he said, citing places like the Midwest, which has consistent winds, and the Southwest, which has mostly cloud-free skies. But other places, like the Southeastern U.S. and many counties in the Asia-Pacific region might be too cloudy or their power grids too fragmented to make traditional renewables work. To compensate for those shortfalls, one approach is to overbuild wind and solar, but that can get expensive quickly. Technologies like fusion “actually bring the cost down of achieving high penetrations of carbon free energy,” Terrell said. “If you have these clean, firm technologies — even if they’re more expensive on a per megawatt-hour basis — if you’re sort of folding those into the portfolio, it actually brings your overall portfolio costs down.” Mumgaard is confident that CFS can deliver power to Google in less than a decade, and when that happens, he thinks that demand for fusion will skyrocket. “It doesn’t depend on geography or weather, doesn’t depend on access to special materials. It’s something that you could run 24/7,” he said. “We expect that fusion can have a really big payoff because once it’s shown that you can do this and you have a first power plant up and running, you could scale it. You could build this around the world.” Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Spotify revamps its Discover Weekly playlist after 10 years", "link": "https://techcrunch.com/2025/06/30/spotify-will-revamp-its-discover-weekly-playlist-after-ten-years/", "pub_date": "2025-06-30T03:00:00-07:00", "description": "Spotify’s Discover Weekly playlist, which shares new listening recommendations every Monday, is getting an update. Ten years after the debut of Discover Weekly (yes, we feel old, too), Spotify Premium users will see new controls at the top of the playlist, which allow them to push their recommendations toward certain genres. So, if you mostly listen to 80s rock, but you’re starting to develop a soft spot for K-pop, you can select different genre filters to push the algorithmic curation in the right direction. This feature is intended to give users a bit more control over what kinds of new music they most want to hear from their Discover Weekly playlists. According to Spotify, users have streamed over 100 billion tracks on Discover Weekly, with 77% of Discover Weekly listens being from emerging artists. To access the new-and-improved Discover Weekly, Spotify Premium subscribers can navigate to the “Made for You” hub, then navigate to their Discover Weekly playlist. There, if the latest Spotify version is installed, users will be able to see the new genre controls. For an app that can feel overwhelmingly dominated by algorithmic recommendations, Spotify has features geared toward giving the listener input over their listening algorithms. The queue was revamped, showing which Spotify recommendations are coming up and allowing users to choose in advance what stays on deck. Listeners can also “snooze” songs they’re tired of so the song won’t be played for 30 days, but also won’t be hidden for good. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Big Tech lands an early win in legal battles against publishers", "link": "https://techcrunch.com/podcast/big-tech-lands-an-early-win-in-legal-battles-against-publishers/", "pub_date": null, "description": "This week, two major AI companies scored early wins in court, with federal judges siding with and in separate lawsuits over how their models were trained on copyrighted material. The decisions represent the first real legal validation of AI companies’ argument that training models on books, images, and other creative works can be considered “fair use” — even if those materials weren’t obtained with permission. It’s a big deal for companies building generative AI, and a potential turning point for the still in motion. Today, on TechCrunch’s podcast, hosts Max Zeff and Anthony Ha were joined by Sean O’Kane (who graciously stepped in while Kirsten headed off to the Nevada desert to see , the startup founded by former Tesla CTO JB Straubel) to dive deeper into the rulings. While neither case sets a precedent yet, Anthony noted that appeals are likely, and could ultimately shape how AI companies interact with entire industries going forward. Listen to the full episode to hear more highlights from the week, including: Equity will be back next week, so stay tuned! © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TechCrunch Mobility: The Tesla robotaxi Rorschach test and Redwood’s next big act", "link": "https://techcrunch.com/2025/06/27/techcrunch-mobility-the-tesla-robotaxi-rorschach-test-and-redwoods-next-big-act/", "pub_date": "2025-06-27T11:45:00-07:00", "description": "Welcome back to — your central hub for news and insights on the future of transportation. Sign up here for free — just click ! Less than a week ago, and giving rides to invited customers in Austin. As Sean O’Kane and I wrote this week, the rollout is the first big test of CEO Elon Musk’s belief that it’s possible to safely deploy fully autonomous vehicles using just cameras and end-to-end AI — an approach that differs from other players in the space, like Waymo. By all accounts (including Tesla’s), this is a limited first run. The operating area covers South Austin, the fleet of vehicles is fewer than 20, and there is still a safety “monitor” sitting in the front passenger seat. That doesn’t mean there was a subdued reaction. Social media provided a flurry of video and personal accounts — from riders and onlookers — of the robotaxis milling about Austin. And in numerous cases, the vehicles appeared to be violating traffic laws such as moving across double yellow lines into the oncoming traffic lane and abruptly hitting the brakes in the middle of intersections. The videos prompted and ask for information on the deployment. The reaction to the Tesla robotaxi rollout — and more specifically, to the videos on social — provided an informative view on just how polarizing the company is. As O’Kane quipped to me the other day, “It’s like a Rorschach test.” Tesla’s robotaxi rides are either evidence of the company’s hubris and Musk’s broken promises on automated driving, or the beginning of the end for Waymo, Uber, and Lyft. Here’s what gets closer to the truth: One week in, and we have a lot of noise and very little signal. On the back of a series of executive departures over the past year, we’re hearing that Tesla is planning another round of layoffs across the company this month. CEO Elon Musk spent the last year working on politics, which culminated in a dramatic exit from his duties as head of DOGE. Now he’s poised to bring that slash-and-burn energy to his own organization and DOGE-ifying the team at Tesla, with low performers on the chopping block, according to one source who is connected to the company. Meanwhile, Tesla is pushing ahead on Cybercab production. One source noted it’s created a pressure-cooker environment that has caused some employees to leave the company. The news cycle this week is giving me 2016 vibes. Take this deal involving co-founder and former CEO . Kalanick is reportedly to buy the U.S. arm of Chinese autonomous vehicle company Pony AI, and Uber might even help make it happen. That’s an interesting move. In 2017, Kalanick was pressured to resign due to reports that he fostered a toxic workplace culture rife with sexual harassment, among other complaints. His resignation came a year after Uber purchased Otto, the self-driving trucks startup co-founded by Anthony Levandowski (CEO Pronto AI), Lior Ron (CEO Uber Freight), Don Burnette (founder of Kodiak Robotics), and Claire Delaunay (former Nvidia, former farm-ng CTO, and current seed investor). That deal, which was absorbed into what became Uber ATG, was controversial from the start and ultimately led to Waymo suing Uber over trade secrets theft. Fast-forward eight years: Waymo and Uber are on friendly business terms, and Kalanick is still wondering, “What if?” The founder has been pretty vocal about saying Uber would have its own self-driving fleet had he still been in charge. Then there’s Pony, which has operations in the U.S. that are at risk due to national security rules. The company has been poised to sell off its U.S. arm since at least 2022. , a new startup developing cathode materials to drive down the cost of LFP batteries, in a seed round led by SOSV. The New Jersey Innovation Evergreen Fund and UM6P Ventures also participated. , the Indian drone startup, in an all-equity Series B round led by General Catalyst. The sent a about its hands-free driver-assistance system BlueCruise as part of an investigation that started more than one year ago following two fatal crashes involving the software. There was a time when AV startups tried to avoid talking about remote driving as a means of supporting its driverless tech. Now companies are openly talking about it. Take self-driving trucks company and , a remote driving startup out of Berlin. The two companies, which this week, have been working together since last year. and have officially entered another market. The companies, which launched the “Waymo on Uber” service in Austin earlier this year, are now operating in a . On top of that, in Atlanta with , an Uber spinout that went public last year. The upshot: Momentum seems to be building for all three companies. Uber is turning into the network connector to autonomous tech (it has 18 AV partnerships globally). Waymo is the robotaxi market leader. It provides 250,000 paid robotaxi rides every week across five major cities. With Atlanta joining that list and expansions in its existing markets, that figure has surely exceeded the 300,000 mark. And Atlanta marks Serve’s fourth commercial city as it works to scale to 2,000 bots on sidewalks by the end of 2025. is launching an that will leverage the thousands of EV batteries it has collected from its battery-recycling business to provide power to companies. And it’s starting with — what else? — AI data centers. has laid off ahead of its launch of the more affordable R2 SUV in 2026. The manufacturing team was hit the hardest. ’s top sales executive has reportedly . Omead Afshar was one of Musk’s closest confidants who just this week was posting on X about the “historic day for Tesla” when the company rolled out its robotaxis in Austin. There was a moment around 2017 when appeared poised to become a dominant player in automotive. The company had acquired Mobileye, and its VC arm was investing millions into the sector. It was part of the future of transportation conversation. Now Intel is saying — including its AI-enhanced system-on-chip design for vehicles that had been set for production by the end of 2025 — and laying off most of its staff as part of a broader restructure. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Apple updates the rules for its EU App Store by adding more complicated fees", "link": "https://techcrunch.com/2025/06/26/apple-updates-the-rules-for-its-eu-app-store-by-adding-more-complicated-fees/", "pub_date": "2025-06-26T13:38:29-07:00", "description": "Apple on Thursday a series of updates to its developer policies to comply with the EU’s Digital Markets Act (DMA). The news, which was expected, arrived just in time to meet the deadline of June 26, after which the iPhone maker would risk new fines. The changes involve both how app developers can communicate with their customers and the fees Apple charges. EU regulators had earlier for noncompliance with the DMA and were threatening to impose further penalties, forcing Apple’s hand. In terms of Apple’s new “anti-steering” rules, which dictate customer communications, EU app developers will now be able to link to alternative ways to pay for subscriptions and other in-app purchases outside the App Store across any channel. That means they can share this link on a website, an alternative app marketplace, within another app, and more. These links can also be accessed outside the app or within the app using a web view or native experience, Apple said, and don’t have to use warning screens or the text that Apple previously required. In addition, instead of dropping its Core Technology Fee (CTF), Apple introduced a more complex fee structure. There’s now an initial acquisition fee (2%) and a store services fee. The latter is either 13% or 5%, depending on the tier the developer chooses. (Small Business program members pay 10%.) Tier 1 developers have access to a more limited set of App Store services, including app reviews, manual updates, and antifraud measures. to marketing tools, automatic updates, curation and personalization features, app insights, and more. Then, for apps that want to link to alternative methods of payment via the StoreKit External Purchase Link Entitlement (EU) Addendum, there’s a Core Technology Commission (CTC). This will ultimately replace the CTF. Before today, the developers paid the CTF of €0.50 for each app install after the app topped 1 million downloads. That will continue for developers on the alternative EU business terms. For developers on the standard terms in the EU, the CTC — a 5% commission — will instead apply. Developers who currently pay the old CTF will move to the new rules by January 1, 2026. “The CTC reflects the value Apple provides developers through ongoing investments in the tools, technologies, and services that enable them to build and share innovative apps with users,” Apple said in a statement. Epic Games CEO Tim Sweeney, whose company sued Apple and won the right to use alternative payments without a commission in the U.S., calling it more malicious compliance from Apple. “Apple’s new Digital Markets Act malicious compliance scheme is blatantly unlawful in both Europe and the United States and makes a mockery of fair competition in digital markets. Apps with competing payments are not only taxed but commercially crippled in the App Store,” he said. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Redwood Materials launches energy storage business and its first target is AI data centers", "link": "https://techcrunch.com/2025/06/26/redwood-materials-launches-energy-storage-business-and-its-first-target-is-ai-data-centers/", "pub_date": "2025-06-26T20:36:04-07:00", "description": "Tucked between two massive buildings in the hills of the Nevada desert, 805 retired EV batteries lie in neat formation, each one wrapped in nondescript white tarps — and hiding in plain sight. A passerby might not realize this unassuming array is the largest microgrid in North America, that it’s powering a 2,000 GPU modular data center for AI infrastructure company Crusoe, or that it represents the next big act of JB Straubel, the co-founder and CEO of Redwood Materials. Redwood Materials announced Thursday during an event at its Sparks, Nevada, facility that it was launching an energy storage business that will leverage the thousands of EV batteries it has collected as part of its battery-recycling business to provide power to companies. And they’re starting with AI data centers. The new business, called Redwood Energy, is kicking off with partner Crusoe, a startup Straubel invested in 2021. The old EVs, which are not yet ready for recycling, store energy generated from an adjacent solar array. The system, which generates 12 MW of power and has 63 MWh of capacity, sends power to a modular data center built by Crusoe, a company best known for its large-scale data center campus in Abilene, Texas — the initial site of the Stargate project. The scale of Redwood’s battery-collection operation is staggering — and an opportunity. Redwood said it recovers more than 70% of all used or discarded battery packs in North America. Today, it processes more than 20 GWh of batteries annually — the equivalent of 250,000 EVs. It has apparently been stockpiling batteries that aren’t ready for recycling, with more than 1 gigawatt-hour worth in its inventory already. In the coming months, it expects to receive another 4 gigawatt-hours. By 2028, the company said it plans to deploy 20 gigawatt-hours of grid-scale storage, placing it on track to become the largest repurposer of used EV battery packs. Straubel’s confidence in the endeavor was apparent in every detail of the launch event. To illustrate the commitment of Redwood — and by extension, Straubel — everything at the event, from the music and projection on the big screen to a laser light show that included giant Pac-Man ghosts navigating the rows of EV batteries, was powered by the microgrid. “We wanted to go all in,” Straubel said, breaking into a wide, toothy smile. Splashy effects for the event aside, the microgrid setup with Crusoe is not a demonstration project. Straubel said this is a revenue-generating operation, which was constructed in four months, and one that is profitable. He added that even more of these will be deployed with other customers this year. “I think this has the potential to grow faster than the core recycling business,” he said. Redwood Materials has been on an expansion tear in recent years. The company, which has raised , was founded in 2017 by Straubel, the former Tesla CTO and current board member, to create a circular supply chain. The company started by recycling scrap from battery cell production and from consumer electronics like cell phone batteries and laptop computers. After processing these discarded goods and extracting materials like cobalt, nickel, and lithium that are typically mined, Redwood supplies those back to Panasonic and other customers. Over time, the company has expanded beyond recycling and into cathode production. Redwood generated in 2024, much of which comes from the sale of battery materials like cathodes. The company’s footprint has grown, too, and well beyond its Carson City, Nevada, headquarters. It has locked up deals with Toyota, Panasonic, and GM; started construction on a ; and in Europe. Redwood Energy is the next step — and one that isn’t tied to setting up its systems to be off-grid. The retired EV batteries can be powered by wind and solar, or they can be tied to the grid. In the case of the Crusoe project, the system is powered by solar. “There’s no green intent required here,” CTO Colin Campbell said during a tour of the microgrid. “It’s a good economic choice that also happens to be carbon-free.” The business model addresses a long-standing challenge in the energy storage sector. For over a decade, companies have been promising to build grid-scale storage from used EV batteries, but they’ve only materialized in small amounts. Redwood, which got its start as a battery materials and recycling company, is creating a new line that promises to deliver gigawatts of much needed energy storage in just a few years. “This really demonstrates how economical the waste hierarchy actually is,” Jessica Dunn, a battery expert at the Union of Concerned Scientists, told TechCrunch. That a large recycler like Redwood recognized the profit potential in repurposed EV batteries shows “where this end-of-life market will go,” she added. Repurposing batteries is a clear business opportunity for Redwood, but it might also be a business imperative. Redwood was founded to build a supply chain that could handle the predicted wave of used EV batteries that will hit the market. But that wave hasn’t materialized quite as quickly as some predicted. “If Redwood didn’t enter the repurposing market, then they wouldn’t get a share from the repurposed battery. They’d have to wait the five, 10, 15 years until they retired,” she said. In the meantime, other companies would be able to sell the batteries for grid-scale storage, cutting Redwood out of years of revenue. Straubel acknowledged this, noting in an interview that in many ways Redwood Materials started a bit early. “We started really early, and in a way we started Redwood almost too early,” he said, noting the company initially was collecting consumer batteries and production scrap ahead of the coming wave of EVs. The current state of the recycling market underscores the challenge. “Right now, the recycling market is mostly manufacturing scrap, consumer electronics, and EV batteries that have failed under warranty,” Dunn said. That has been enough for Redwood to process over 20 gigawatt-hours annually. But it pales in comparison to the 350 gigawatt-hours in EVs today and the 150 gigawatt-hours expected to hit the road every year. Redwood currently has a recycling facility at its 175-acre campus in Sparks, Nevada, and it’s developing a in Charleston, South Carolina. The latter will remanufacture cathode and anode copper foil, both of which contain critical minerals that the U.S. would prefer stayed within its borders. The company previously said that it will be capable of making 100 gigawatt-hours annually of cathode active material and anode foil by the end of this year. By the end of the decade, it expects production to hit 500 gigawatt-hours. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Google launches Doppl, a new app that lets you visualize how an outfit might look on you", "link": "https://techcrunch.com/2025/06/26/google-launches-doppl-a-new-app-that-lets-you-visualize-how-an-outfit-might-look-on-you/", "pub_date": "2025-06-26T14:19:11-07:00", "description": "Google is launching a new experimental app called Doppl that uses AI to visualize how different outfits might look on you, the company on Thursday. The app is available on and in the U.S. Doppl is designed to let you virtually try on outfits on a digital version of yourself. The app works by first getting you to upload a full-body photo of yourself. From there, you can use photos or screenshots of different outfits to virtually try them on. These images could be a photo of an outfit you see at a thrift store or on a friend, or even a screenshot of an outfit you see while scrolling through social media. Once you select an outfit that you want to visualize, Doppl will create an image of a virtual version of yourself wearing the outfit. Doppl can also take these static images and convert them into AI-generated videos so you can get a better sense of how the outfit would look on you in real life. You can save your favorite looks and browse through all of your other virtual try-ons. Plus, you can also share your look with others. The tech giant says the new app builds on capabilities that allow you to try on clothes virtually. By launching the functionality in a stand-alone app, Google is making the feature easier to access while allowing people to explore their style in a fun and interactive way, the company believes. It may also help Google collect more data on how apps like this could work, to aid its future efforts in the space. While Google has offered , the earlier features focused on showing items on a diverse range of models’ bodies. With Doppl, the company is letting you try clothes on an animated version of your own body. “We hope Doppl helps you explore your style in new and exciting ways,” Google said in a blog post. “As a Google Labs experiment, Doppl is in its early days and it might not always get things right. Fit, appearance and clothing details may not always be accurate.” Given that the Doppl is an experimental launch, it’s unknown when or if Google plans to bring the app to additional regions. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TikTok is testing its own version of Instagram’s ‘broadcast channels’", "link": "https://techcrunch.com/2025/06/27/tiktok-is-testing-its-own-version-of-instagrams-broadcast-channels/", "pub_date": "2025-06-27T13:22:00-07:00", "description": "TikTok is testing a new messaging tool called “bulletin boards,” the social network confirmed to TechCrunch on Friday. The feature lets brands and creators share public, one-to-many messages to their followers. Bulletin boards are pretty similar to Instagram’s feature that launched in 2023. Just like with broadcast channels on Instagram, only the creator of a bulletin board can post messages, and followers are limited to leaving emoji reactions. Bulletin boards support text, image, and video posts. The feature was first spotted by Christina Garnett. The idea behind the feature is to allow creators and brands to share updates and behind-the-scenes content and to engage with their followers in a more direct way. For example, rather than posting updates through a Story or regular post on TikTok, brands and creators can share them on their bulletin board. The feature also lets accounts promote their content by directly sending it to followers. Some early testers of the feature include People magazine, Paris Saint-Germain F.C., and the Jonas Brothers. Given that bulletin boards are a test feature, it’s unknown whether TikTok plans to roll it out more widely. Plus, it’s possible that TikTok may add more functionality. Instagram’s broadcast channels, for example, let creators post polls. The launch of bulletin boards is the latest example of one social network borrowing features from another. Back in 2022, TikTok , along with , in order to take on Instagram. Of course, Instagram copied TikTok’s entire playbook with of Reels in 2020. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "YouTube’s mobile video editor is coming to iOS", "link": "https://techcrunch.com/2025/06/27/youtubes-mobile-video-editor-is-coming-to-ios/", "pub_date": "2025-06-27T13:38:02-07:00", "description": "Google is preparing to bring YouTube Create to iOS devices nearly two years after the video editing app launched exclusively on Android. Job listings reviewed by TechCrunch reveal the company is actively hiring engineers in India for the iOS development project. The show Google is recruiting software engineers in Bengaluru specifically to build the iOS version. The original Android app in the U.S. and seven other markets in September 2023, then expanded to by February 2024. YouTube Create provides free mobile video editing tools designed for content creators, offering features like stickers, GIFs, and effects for both YouTube Shorts and longer-form videos. Google developed the app after consulting with 3,000 creators to ensure it met their needs. The app is Google’s attempt to compete with ByteDance’s popular CapCut editor. But exclusive Sensor Tower data shared with TechCrunch shows YouTube Create is quite far behind CapCut and another established competitor, InShot. The competition isn’t even close. In the second quarter of this year, CapCut and InShot have been downloaded 66 million and 21 million times, respectively, on Android devices. In contrast, YouTube Create has seen fewer than 500,000 downloads this quarter and just 4 million downloads since its launch. The user engagement gap is even more pronounced. CapCut boasts more than 442 million monthly active users on the Android app in Q2, while InShot claims 92 million. YouTube Create lags far behind with fewer than 1 million monthly active users. On iOS — the platform YouTube Create is now targeting — the competition is just as fierce. CapCut leads with 194 million monthly active users in Q2, followed by InShot with 25 million. Meanwhile, CapCut and Instagram’s Edit have dominated iOS downloads this quarter, with 28 million and 7 million downloads, respectively. Despite lagging in the numbers, YouTube Create shows some momentum, with a 28% year-over-year increase in monthly active users in Q2, outpacing a 9% rise for CapCut and a 7% decline for InShot, per the Sensor Tower data. “While boasting solid user growth on a year-over-year basis, YouTube Create has struggled to keep up with some of its larger, more established peers such as CapCut, with the latter having more than 10x the number of monthly active users,” said Abe Yousef, a senior insights analyst at Sensor Tower. YouTube Create may be building a more loyal user base, Yousef suggested. Rising active user numbers alongside declining downloads could indicate that people who previously tried the app are returning to use it regularly. “CapCut coming out many years ago, coupled with the fact that it’s seamlessly integrated with its sister app, TikTok, likely plays into this material size difference with YouTube Create,” said Yousef. Still, YouTube Create is facing some retention issues. Its 90-day retention rate — the percentage of users who downloaded the app and still use it 90 days later — was roughly 1% in Q1, far below CapCut’s 7% and InShot’s 4%. Engagement metrics highlight the gap, too. Users spend an average of 38 minutes per month on YouTube Create, compared to 62 minutes for CapCut users. CapCut users also open the app more often, averaging 23 sessions monthly versus 11 for YouTube Create. Geographically, YouTube Create’s user base is diversifying. India represented 67% of total monthly active users on YouTube Create in the second quarter of last year, but that share has dropped to 51% this quarter as the app gains traction elsewhere. Still, YouTube Create appears to be gaining stickiness in India, with daily-to-monthly active user ratios improving from 9% last year to, so far, 12% this year. In addition to India, Indonesia has emerged as YouTube Create’s second-largest market, representing 21% of its global monthly active users. Germany (5%), Brazil (4%), and the U.K. (3%) round out the top markets. The app is showing particularly strong growth in several other markets, too, with year-over-year monthly active user increases of 119% in Spain, 91% in South Korea, 89% in France, and 71% in Singapore. “An iOS release of YouTube Create could absolutely help the platform grow its market share, though fierce competition in the space both from other social media-backed video editing platforms and native video editors will persist,” Yousef said. Google did not respond to requests for comment. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "At TechCrunch All Stage, Jahanvi Sardana shares how top startups reshape markets", "link": "https://techcrunch.com/2025/06/26/new-session-at-techcrunch-all-stage-jahanvi-sardana-on-how-top-startups-reshape-markets/", "pub_date": "2025-06-26T15:44:56-07:00", "description": "— the ultimate founder summit — is shaping up to be a powerhouse event where 1,200 founders and VCs across all stages will come together to forge meaningful connections and gain practical insights they can immediately apply to scale their startups. Join us on July 15 at SoWa Power Station in Boston and be part of the conversation with scaling experts. And now is the best time to register to attend. For a limited time, , both more than 60% off their regular price. And those discounts deepen when you register for a group of four or more. from Boston and beyond jumps back up! Adding even more value to this already-packed agenda, we’re excited to announce that Jahanvi Sardana, partner at , has joined the breakout session lineup. Sardana will dive into the critical elements of assessing total addressable market (TAM), revealing how the best startups don’t just size markets — they create them. Using case studies from high-growth companies such as Datadog, Adyen, Wiz, Shopify, and Airbnb, she will explore how these businesses identified emerging trends, eliminated friction, and expanded their TAM beyond initial projections. This session is essential for founders aiming to build companies that will shape the future of their industries. This is your opportunity to get direct answers from Jahanvi on scaling challenges and learn what it truly takes to propel your business forward. As a B2B investor, specializes in cybersecurity, enterprise software, and fintech, investing across seed to pre-IPO stages. She thrives on partnering with founders who embody grit — the secret ingredient that sets high performers apart. It’s the perfect mix of passion, persistence, and stamina that turns visionary ideas into reality. Prior to Index Ventures, Jahanvi was at Stripes, a growth equity firm in New York, where she focused on cybersecurity, fintech, and SaaS investments. Her career began in private equity at Aquiline Capital Partners. Don’t miss this session at — plus more led by industry leaders like Charles Hudson, founder and managing partner at Precursor Ventures; Brandon Krieg, co-CEO and co-founder at Stash; and many others. This is your opportunity to ask scaling questions, build game-changing connections, and, for VCs, discover the next big investment. Elevate your brand by showcasing your innovation to 1,200 founders and investors seeking real solutions to fuel their businesses. Limited space available. Or, explore sponsorship opportunities and activations at TC All Stage. Get in touch with our team by . and be the first to know about special deals and event announcements. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TechCrunch All Stage: Learn how AI can supercharge your MVPs with Chris Gardner", "link": "https://techcrunch.com/2025/06/26/techcrunch-all-stage-learn-how-ai-can-supercharge-your-mvps-with-chris-gardner/", "pub_date": "2025-06-26T14:00:56-07:00", "description": ", our big event for founders of startups at all stages of funding (see what we did there?), is coming up July 15 at Boston’s SoWa Power Station. And it’s our pleasure to announce that will join a loaded lineup of speakers by leading a breakout session titled “MVP in the Age of AI: When to Bot and When to Not.” Spoiler: Expect to learn about using AI for minimum viable products. And for for a very limited time, we’re launching discounts for our Investor and Founder Passes to make those learnings, and many others, easier to access. , more than 60% off our usual pricing with All Stage coming up so soon. Those discounts deepen is you bring a group as well, so come make connections with VCs and learn from the expects along with 1,200 other attendees in the heart of Boston. Our limited-time discounts on Investor and Founder Passes are ending soon, with an additional discount on group buys of four or more. If you’re looking to get the insights you need to scale or make connections with the VCs who can make that scaling possible, this is your chance to meet and learn from more than 1,200 attendees in the heart of Boston. Don’t wait — ! We know — AI is the buzzword in seemingly every company’s pitch and product roadmap, as well as in the programming and side conversations at events like TC All Stage. But with this session, Chris has a focus on a crucial thing for startups to get right: developing MVPs that are actually kept at a minimum and actually viable. That can come with significant help from AI, which can lead to a rate of software development and prototyping that would have seemed ridiculous a few years ago. But it can also limit your potential, leaving behind the human element that fuels every successful product’s construction and rollout. And that’s something that every startup, regardless of their fundraising stage, can learn from. Chris joins the growing for this year’s TechCrunch All Stage, calling upon his years of experience across fintech, speech recognition, e-billing, and beyond. In previous roles, he led PayPal’s P2P, PayPal Here, and other projects following the acquisition of Paydiant, a company he co-founded — and he played a prominent role in PayPal’s $2.2 billion acquisition of iZettle. Though his current day job is in pre-seed and seed B2B investments, he’s admittedly still eager to get involved in hands-on projects, which explains his choice of session topic at this year’s event. Before you even consider passing on the at TechCrunch All Stage, keep in mind that this is just one of many sessions at the conference . Sessions include an expert course in total addressable market assessment from , lessons on the new rules of growth-stage fundraising at Series C and beyond, the secrets of how VCs are judging your pre-seed company, and more. So take a look and ! And yes, you can still exhibit your startup in front of fellow attendees and experts by . Or, explore sponsorship opportunities and activations at TechCrunch All Stage. Get in touch with our team by . and be the first to know about special deals and event announcements. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Jesse Draper’s Halogen Ventures closes $30M Fund III to focus on ‘future of family’", "link": "https://techcrunch.com/2025/06/27/jesse-drapers-halogen-ventures-closes-30m-fund-iii-to-focus-on-future-of-family/", "pub_date": "2025-06-27T13:23:26-07:00", "description": "Posted: Halogen Ventures closed a $30 million Fund III to invest in building in the “future of family,” The firm by Jesse Draper, the daughter of famed venture capitalist Tim Draper. She explained to Fortune that the fund will focus on the physical and financial health of households. Startups in the care economy have received more investor interest in the past few years after the pandemic, which exacerbated childcare and elderly care struggles. Other funds that work in this space include Pivotal Ventures and Magnify Ventures. Halogen focuses on consumer companies that have at least one female founder. It has invested in companies such as Teal Health and Vibrant Planet, and last raised a $21 million Fund II in 2021 and a $10.41 million Fund I in 2018, per PitchBook. Halogen did not immediately respond to our request for comment. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "This AI-powered startup studio plans to launch 100,000 companies a year — really", "link": "https://techcrunch.com/2025/06/26/this-ai-powered-startup-studio-plans-to-launch-100000-companies-a-year-really/", "pub_date": "2025-06-26T18:59:29-07:00", "description": "Henrik Werdelin has spent the last 15 years helping entrepreneurs build big brands like Barkbox through his startup studio . Now, with his new, New York-based venture , he’s betting that AI can help him scale that process from “tens” of startups a year to “hundreds of thousands” of aspiring business owners. The timing certainly feels right. Mass layoffs across a variety of industries have left many workers reconsidering their career paths, while AI tools have markedly lowered the barrier to building digital products and services. At the center of that Venn diagram is Werdelin’s latest venture, with its promise to help “everyday entrepreneurs create million dollar AI companies” without requiring technical skills. Werdelin’s journey from Prehype to Audos reflects the broader transformation happening in entrepreneurship right now. At Prehype, the focus was on working with tech founders to build traditional startups, the kind that might raise millions and aim for billion-dollar exits. Now, he tells TechCrunch, “what we’re trying to do is take all that knowledge, all the methodology that we’ve created over the years of building all these big companies, and really trying to democratize it.” The idea is that “everyday entrepreneurs” may sense a shift is afoot but may not be keen to experiment with so-called AI agents or know how to reach customers. Audos is more than happy to help them, supplying these individuals with AI tools to build sophisticated products using natural language and taking advantage of social media algorithms to find them their niche customers. “Facebook and a lot of these platforms, they are just incredible algorithms, and they’re incredible at figuring out [how to reach your customer] if you define a customer group,” says Werdelin, who co-founded Audos with his Prehype partner Nicholas Thorne. In fact, Audos uses this system to quickly test whether a founder’s business idea has sustainable customer acquisition costs. The approach seems to be working. Audos has helped launch “low hundreds” of businesses since its beta launch, with its own customers discovering the platform through Instagram ads asking, “Have you ever thought about starting something, but don’t know where to go?” Among them, Werdelin says, are a car mechanic who wants to help people evaluate repair quotes, an individual who is selling “after death logistics” services, virtual golf swing coaches, and AI nutritionists. In a winking reference to billion-dollar businesses, or “unicorns,” he calls these one- and two-person teams “donkeycorns.” All went through the same process: They clicked on Audos’ ad, its AI agent launched a conversation to figure out the problems these individuals want to tackle and who they want to serve, and when it was satisfied with the answers, Audos got them in front of potential customers as fast as possible. As for returns, Audos operates on a fundamentally different model than traditional accelerators or venture capital. Instead of taking equity, the company takes a 15% revenue share from the businesses it helps launch. In return, founders get up to $25,000 in funding, access to those AI-powered business development tools, and help with distribution (again, primarily through paid social media advertising). “We’re not taking any equity in their business,” Werdelin says. There isn’t much point. “We don’t think these companies might ever get sold,” he says. “What we’re really inspired by are the mom-and-pop shops that are the backbone of our society.” The revenue share continues indefinitely, similar to platform fees charged by Apple’s App Store. For founders, that means giving up a significant portion of their revenue in perpetuity — a 15% cut that could cost entrepreneurs hundreds of thousands of dollars over time. Some will undoubtedly see that trade-off as worthwhile; others might question whether the long-term costs justify the benefits. Audos’ value proposition raises other questions, too, given how quickly the landscape is changing. While Werdelin emphasizes helping founders build relationships with customers, it’s unclear how much of that work the AI agents can actually handle. There’s also the matter of differentiation. As Werdelin readily acknowledges, “the world is full of these tools,” and they’re getting better rapidly. What happens when entrepreneurs can access similar AI capabilities without paying a permanent revenue tax? Audos’ VCs don’t sound worried about those scenarios. True Ventures led Audos’ $11.5 million seed round, with partner Tony Conrad explaining the appeal in a Zoom call this week. In addition to having confidence in Werdelin and Thorne, Conrad says, “I think there are just lots and lots of people” who might eagerly embrace the opportunity to work with a platform like Audos. Conrad draws parallels to Instagram’s $1 billion exit with just 13 employees, suggesting that AI could enable even more leverage, even if Audos — which itself employs just five people altogether currently — isn’t chasing unicorns. As Werdelin explains it, “What we’re after here is the millions of people who can create million-dollar businesses or half-million dollar businesses that are real and life changing.” Adds Werdelin separately of why he spun up Audos, “What we’re trying to do is to figure out how you make a million companies that do a million dollars [in annual revenue]. That’s a trillion-dollar turnover business.” Midway through 2025, it doesn’t sound crazy. Extending the benefits of entrepreneurship to people who traditionally haven’t had access to startup capital or technical skills is an increasingly compelling proposition as traditional employment begins to feel less and less stable. “We believe that there should be somebody who goes out and really helps these smaller entrepreneurs that are building something that is not venture backable,” says Werdelin. “We believe that the world is better with more entrepreneurship.” Audos’ other investors include Offline Ventures and Bungalow Capital, along with numerous high-profile angel investors — Niklas Zennström and Mario Schlosser among them. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Rollback rates: TechCrunch All Stage brings back early launch prices for a limited time", "link": "https://techcrunch.com/2025/06/27/rollback-rates-techcrunch-all-stage-brings-back-early-launch-prices-for-a-limited-time/", "pub_date": "2025-06-27T07:00:00-07:00", "description": "We’re almost there, and ticket rates have officially rolled back with savings of up to $425. , the founder summit of the year, is just around the corner. On July 15, Boston becomes startup central. Are you ready to gain the insights and strategies you need to launch or scale? For a limited time, we’ve brought back early launch pricing. Founders pay just $155. Investors, only $250. These are the lowest rates you’ll see before the doors open at SoWa Power Station. and pocket big savings. Explore the shaping the conversations. We’re closing in on July 15, and rollback pricing won’t last. and join the founders and VCs defining the next wave of startup success. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "US House bans WhatsApp from staff devices", "link": "https://techcrunch.com/2025/06/24/us-bans-whatsapp-from-house-of-representatives-staff-devices/", "pub_date": "2025-06-24T04:30:07-07:00", "description": "Posted: The U.S. House of Representatives’ top official has banned WhatsApp from government-issued devices used by its staff, saying the app poses potential security risks, Reuters , citing a memo sent to House staff. “The Office of Cybersecurity has deemed WhatsApp a high risk to users due to the lack of transparency in how it protects user data, absence of stored data encryption, and potential security risks involved with its use,” Reuters reported the memo as saying. The memo instead recommends staff use apps like Signal, iMessage, FaceTime, and Microsoft Teams, the report said. Meta in January it had detected and disrupted a hacking campaign targeting about 90 WhatsApp users, including journalists. The hack was linked to Paragon Solutions, an Israeli spyware maker that by American private equity giant AE Industrial Partners. And according to , the governments of Australia, Canada, Cyprus, Denmark, Israel, and Singapore are likely customers of Paragon. “We disagree with the House Chief Administrative Officer’s characterization in the strongest possible terms,” a Meta spokesperson said in an emailed statement. “Messages on WhatsApp are end-to-end encrypted by default, meaning only the recipients and not even WhatsApp can see them. This is a higher level of security than most of the apps on the CAO’s approved list that do not offer that protection.” Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Homeland Security warns of Iran-backed cyberattacks targeting US networks", "link": "https://techcrunch.com/2025/06/26/homeland-security-warns-of-iran-backed-cyberattacks-targeting-us-networks/", "pub_date": "2025-06-26T09:20:00-07:00", "description": "Posted: A by U.S. Homeland Security said it expects to see Iranian government-backed hackers conduct attacks against U.S. networks, amid the ongoing conflict between the U.S. and Israel and Iran. The National Terrorism Advisory System bulletin said low-level cyberattacks by are “likely,” adding that hacktivists and government-linked hackers “routinely target” poorly secured U.S. networks and internet-connected devices to cause disruption. The bulletin was published days after a series of U.S. and Israeli air strikes targeted Iran’s nuclear program, which appeared to coincide with destructive hacks carried out by a pro-Israel hacking group, dubbed Predatory Sparrow. The hackers took out and held by the country’s largest crypto exchange. Following the initial round of Israeli air strikes, the Iranian government to protect against cyberattacks. Iran is known for its offensive cyber capabilities, including long-running espionage operations , as well as designed to steal data from businesses and tech giants, often by using . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "US, French authorities confirm arrest of BreachForums hackers", "link": "https://techcrunch.com/2025/06/26/us-french-authorities-confirm-arrest-of-breachforums-hackers/", "pub_date": "2025-06-26T09:28:54-07:00", "description": "U.S. and French authorities have confirmed the arrests of five hackers accused of being behind several major hacks and being part of a notorious cybercrime forum. On Thursday, the U.S. Department of Justice the of British national Kai West, 25, accusing him of being “a serial hacker” known as IntelBroker. U.S. authorities allege West is behind “a years-long hacking scheme,” which caused more than $25 million in damages by targeting more than 40 victims, including a telecoms company, a municipal healthcare provider, and an internet service provider. In the case of the healthcare provider, the DOJ alleges West tried to sell sensitive patient’s personal information, including names, Social Security numbers, dates of birth, genders, and health plan and employer information. Per the DOJ, West was the leader of a hacking group known as “CyberN[——]”, referring to a racist slur, which frequented “a particular internet forum.” While the DOJ did not name the forum, the complaint includes details that reference BreachForums, which was previously shut down by a coalition of international law enforcement agencies in 2023 and 2024. The DOJ press release said West was arrested in France earlier in February and is now facing extradition to the United States. According to the against West, the CyberN[——] group included four other individuals who U.S. authorities have not named. Those four individuals appear to have been arrested in France earlier this week. On Wednesday, Paris prosecutor Laure Beccuau that French police arrested four people suspected of running BreachForums and of being part of a collective called “ShinyHunters.” “This week’s arrests targeted the individuals suspected of being the site’s main administrators, and raised hopes of its permanent closure,” said Beccuau, according to a translation of the press release. The prosecutor also confirmed West, only named in the statement as IntelBroker, had been arrested in France in February, which aligns with what U.S. authorities announced on Thursday. When reached for comment, a spokesperson for the French prosecutor’s office referred TechCrunch to its published statement. In response to a question about the four unnamed co-conspirators, U.S. Justice Department spokesperson Nicholas Biase said he couldn’t comment on “uncharged individuals,” and declined to clarify in a follow-up email. BreachForums was one of the most well-known hacking forums on the internet, where cybercriminals sold hacking tools, as well as advertised, sold, and traded data stolen from companies, , and many others. In 2023, U.S. federal authorities , three months after arresting its administrator, , also known as “Pompompurin.” The site then relaunched, but . West is charged with conspiracy to commit computer intrusions, conspiracy to commit wire fraud, accessing a protected computer to obtain information, and wire fraud. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Anthropic’s Jared Kaplan Charts the Course for Enterprise AI", "link": "https://techcrunch.com/video/anthropics-jared-kaplan-charts-the-course-for-enterprise-ai/", "pub_date": "2025-06-06T15:09:00-07:00", "description": "Anthropic Co-Founder and Chief Science Officer Jared Kaplan joined TechCrunch Senior Reporter Maxwell Zeff at our event to talk about the hottest topic within the AI community right now: agents. In Kaplan’s view, chatbots are just the start, and agents will be the next frontier in expanding what AI can be capable of accomplishing. Kaplan also addressed a couple recent flashpoints with Anthropic, including the company , reportedly set to be acquired by OpenAI, as well as the . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Ring cameras and doorbells now use AI to provide specific descriptions of motion activity", "link": "https://techcrunch.com/2025/06/25/ring-cameras-and-doorbells-now-use-ai-to-provide-specific-descriptions-of-motion-activity/", "pub_date": "2025-06-25T06:00:00-07:00", "description": "Amazon-owned Ring announced on Wednesday that it’s introducing a new AI-powered feature to its doorbells and cameras, which offers users specific text descriptions of current motion activity. Now, when users receive real-time notifications about happenings at their property, the updates will be more descriptive. For instance, “A person is walking up the steps with a black dog,” or “Two individuals are looking into a white car parked in the driveway.” The feature aims to improve upon the vague notifications that were previously available. Users will be able to know exactly what is happening and can quickly decide whether it requires immediate attention. It should be noted that the AI only describes the first few seconds of the motion-activated video clip. The feature is being rolled out today as an English-only beta for Ring Home Premium subscribers in the U.S. and Canada. Users can choose to disable the feature by going to settings in the Ring app. According to a by Jamie Siminoff, Ring’s founder and now Amazon’s VP of home security, the company plans to introduce additional AI features. One of these combines several motion events happening in and around a home into a single alert. Ring also intends to implement a “custom anomaly alert” that allows users to define what constitutes an anomaly for their property, enabling the camera to notify them when such an event occurs. Additionally, Siminoff mentioned that Ring will “learn your routine,” so it can inform users when something is out of the ordinary. This may be unsettling for some users, especially considering Ring’s past . “We are just starting to scratch the surface of AI. I feel like we are back to the very early days of Ring again — I see unlimited potential for new experiences we can invent for our neighbors,” Siminoff wrote. This announcement follows the recent launch of Ring’s , which enables users to locate specific moments within video recordings. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Suite AI: how SAP is bringing AI to the enterprise", "link": "https://techcrunch.com/video/suite-ai-how-sap-is-bringing-ai-to-the-enterprise/", "pub_date": "2025-06-09T07:31:00-07:00", "description": "As the adoption of AI increases, hear how SAP is expanding its AI capabilities across the business suite. By catching up with , you can see how to leverage upcoming innovations to boost efficiency, streamline processes, and drive greater engagement across your business. Plus, you’ll get the opportunity to learn about SAP’s AI agent Joule, embedded AI capabilities, and custom AI development. And you can check out the rest of . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Behind your firewall: secure generative AI for regulated enterprises", "link": "https://techcrunch.com/video/behind-your-firewall-secure-generative-ai-for-regulated-enterprises/", "pub_date": "2025-06-09T07:42:25-07:00", "description": "Ever wonder how to use advanced generative AI in healthcare or finance without breaking a sweat over data privacy? This breakout panel from our is perfect for you. Cohere’s Solutions Architect Yann Stoneman and fellow Solutions Architect Betsy Groves steered an interactive conversation during which they demonstrated how to deploy secure, customized AI models on your own turf — no external cloud needed. The duo used real-world use cases from Cohere’s North (an agentic AI workspace) and Compass (multimodal retrieval). If you’re in need of practical tips for tackling compliance challenges, unlocking internal data safely, and delivering tangible value through private AI systems, you’re in luck. Watch the recording of the full session to get yourself ready to build AI solutions behind your own firewall. And you can . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "How AI chatbots keep people coming back", "link": "https://techcrunch.com/video/how-ai-chatbots-keep-people-coming-back/", "pub_date": "2025-06-17T08:39:00-07:00", "description": "Chatbots are increasingly looking to keep people chatting, using familiar tactics that we’ve already seen lead to negative consequences. Sycophancy can make AI chatbots respond in a way that’s overly agreeable or flattering. And while having a digital hype person might not seem like a dangerous thing, it is actually a tactic used by tech companies to keep users talking with their bots and returning to their platforms. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Katie Haun makes the case for tokenizing more of the world", "link": "https://techcrunch.com/video/katie-haun-makes-the-case-for-tokenizing-more-of-the-world/", "pub_date": "2025-06-19T16:43:05-07:00", "description": "Katie Haun, founder of Haun Ventures, is a leading voice at the intersection of crypto, policy, and venture capital and will share what it takes to invest with conviction in volatile, high-stakes markets. From her DOJ roots to building a $1.5B+ firm, Katie offers a rare, inside look at navigating regulatory headwinds, backing bold founders, and building trust with LPs across cycles. Haun joined us at , among several other speakers whose discussions Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Why Robinhood’s co-founder is betting on solar power from space", "link": "https://techcrunch.com/video/why-robinhoods-co-founder-is-betting-on-solar-power-from-space/", "pub_date": "2025-06-19T16:43:01-07:00", "description": "As the co-founder of Robinhood, Baiju Bhatt helped redefine how millions of people interact with trading and investing. Now he’s setting his sights even higher — literally — with Aetherflux, a new venture aiming to harness solar power in space. In this chat, Bhatt talks about what drew him to one of the most audacious bets in tech, how building in hard science compares to fintech, and why big risks still matter. Bhatt joined TechCrunch at , among several other speakers whose discussions Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Advice on making early bets from an investor who’s backed 60 successes", "link": "https://techcrunch.com/video/advice-on-making-early-bets-from-an-investor-whos-backed-60-successes/", "pub_date": "2025-06-19T16:43:02-07:00", "description": "Navin Chaddha has backed over 60 companies that have gone public or been acquired. In this conversation, the longtime Mayfield managing partner shares what he looks for in founders, why emotional resonance still matters in early-stage investing, and where he’s placing his bets in AI and beyond. Chaddha spoke at , among several other speakers whose discussions Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "The AI policy playbook: What global startups need to know", "link": "https://techcrunch.com/video/the-ai-policy-playbook-what-global-startups-need-to-know/", "pub_date": "2025-06-09T08:02:00-07:00", "description": "AI is revolutionizing how startups operate, but navigating policy, regulation, and global expansion remains a challenge. In this breakout discussion from , three expert speakers explore how startups can leverage AI-driven tools for digital trade, compliance, and scaling across borders. They include… Whether you’re a founder, investor, or policymaker, this session will provide actionable takeaways to turn AI into a competitive advantage in a fast-changing global landscape. And . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "What the next generation of AI natives mean for founders and funders", "link": "https://techcrunch.com/video/what-the-next-generation-of-ai-natives-mean-for-founders-and-funders/", "pub_date": "2025-06-20T16:43:00-07:00", "description": "Ali Partovi has helped launch the careers of a generation of elite founders through Neo. Russell Kaplan is building Cognition, the AI-native company behind Devin, the so-called “AI software engineer.” Together, they unpack what it means to build and back technical talent in the AI age, what young founders often get wrong, and why this moment feels different from past tech waves. Partovi and Kaplan joined TechCrunch at in June 2025, among several other speakers whose discussions you can find here: Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TechCrunch All Stage 2025 welcomes Boldstart partner Ellen Chisa to talk early-stage enterprise bets", "link": "https://techcrunch.com/2025/06/27/techcrunch-all-stage-2025-welcomes-boldstart-partner-ellen-chisa-to-talk-early-stage-enterprise-bets/", "pub_date": "2025-06-27T11:05:08-07:00", "description": "We’re thrilled to announce that Ellen Chisa, partner at , will be joining us at for an energizing conversation about investing in enterprise startups from day one. She’s one of the standout voices shaping this year’s lineup of founders, funders, and operators gathering July 15 in Boston’s SoWa Power Station, and you won’t want to miss what she brings to the table. All Stage is where startup builders get real answers to real questions — from how to raise your next round to how to manage founder burnout. Whether you’re scaling your team, fixing your financial model, or just figuring out your next move, All Stage is built to give you the tactical playbook and trusted community you need to grow faster and smarter. And we have a special limited-time discount in motion for TechCrunch All Stage, with , and , with students also getting a chance to attend for just $99. ! If you don’t already know Ellen Chisa, she’s the kind of investor early-stage founders dream of having in their corner. At Boldstart Ventures, Ellen backs enterprise software companies before most VCs are even paying attention — and she brings deep product and technical empathy to the table. Before joining Boldstart, she co-founded , a programming language and cloud infrastructure platform built to help developers ship faster. That experience, combined with her product leadership roles at Kickstarter and Lola Travel, makes her uniquely fluent in the realities of building and scaling software from zero to one. Ellen holds a B.S. in electrical and computer engineering from Olin College and an MBA from Harvard Business School, which adds even more firepower to her founder-first approach. She’s as comfortable talking about infrastructure as she is discussing long-term company-building — and that makes her a go-to voice for early-stage founders navigating complex technical bets. At , Ellen will share insights on what investors are really looking for in the earliest stages of enterprise software, how founders can position themselves for conviction-level backing, and the common traps to avoid when building in a noisy, fast-changing landscape. Her perspective is especially valuable for first-time founders and technical teams transitioning into startup life. She’ll be joined by other top minds in tech and venture, including operators, engineers, and investors who’ve built billion-dollar companies and want to help you do the same. expects to draw hundreds of ambitious startup leaders looking for clarity, capital, and connection — and the conversations happening on- and offstage will shape the next generation of great companies. Ellen Chisa’s session is a must-see for anyone building the future of enterprise tech. Don’t miss your chance to learn from her and others charting the course of modern startups. , especially with our latest, limited-time deal that nets you more than a 60% discount on some passes, and get your seat at TechCrunch All Stage, where the real startup playbooks get revealed. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "What comes after Twitter and Meta? The founders of 01A share their playbook at TechCrunch Disrupt 2025", "link": "https://techcrunch.com/2025/06/27/what-comes-after-twitter-and-meta-the-founders-of-01a-share-their-playbook-at-techcrunch-disrupt-2025/", "pub_date": "2025-06-27T11:40:00-07:00", "description": "is coming to Moscone West in San Francisco on October 27–29, and we’re bringing the heavy hitters to the . On October 28, three names that helped shape the modern internet are sitting down for an exclusive fireside chat on what it takes to build, scale, and fund startups in today’s ever-shifting tech landscape. Adam Bain, Dick Costolo, and David Fischer are now leading the charge at , a venture firm investing in breakout companies like Tipalti and SpotOn. But before they were backing the next generation, they were the operators running some of tech’s most iconic companies. , former COO of Twitter, helped transform the platform from a scrappy social tool into a global business. He built Twitter’s sales, product, and ad operations teams from the ground up, growing revenue from millions to billions in just five years. , Twitter’s former CEO, led the company through hypergrowth — expanding headcount by more than 400%, establishing its long-term strategy, and increasing annual revenue from $28 million to $2.25 billion. Before that, he founded FeedBurner, one of the earliest content distribution platforms, later acquired by Google. , former chief revenue officer at Meta, was the architect of the company’s global ad business. Over more than a decade, he scaled annual revenue from under $1 billion to over $100 billion and helped more than 200 million businesses connect with customers across the globe. He also helped build Google’s early sales engine and once served in the U.S. Treasury Department. This session isn’t just about what these three have done — it’s about where they believe tech is headed next. From finding product-market fit to scaling with intention, they’ll share firsthand advice and stories that go beyond boardroom strategy. Expect sharp takes on fundraising in today’s market, how to build high-performing teams, and what they look for when backing founders through 01A. If you’re building a company — or betting on one — this is your blueprint for doing it with staying power. Join 10,000 tech, startup, and VC leaders at this Builders Stage session — and every other high-impact session, networking opportunity, and bespoke activation happening at Disrupt 2025. It’s all part of our 20th anniversary celebration of innovation, ambition, and the builders shaping what’s next. before prices increase. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "StrictlyVC Palo Alto", "link": "https://techcrunch.com/events/strictlyvc-palo-alto/", "pub_date": null, "description": "StrictlyVC events deliver exclusive insider content from Silicon Valley and the global venture scene. If you’re an investor looking to mingle with your peers and watch some killer content, this event is for you. Get the inside scoop directly from sources you can trust. Previous events included interviews with Sam Altman (Open AI), Marc Andreessen (Andreessen Horowitz), Katie Haun (Haun Ventures), Hans Tung (GGV Capital) and many more! TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. If you’re interested in learning more about how your company can be a part the event, get in touch with our sales team below. From seed to Series C and beyond, on brings together the entire startup ecosystem. Learn from experts like Charles Hudson (Precursor Ventures), Jahanvi Sardana (Index Ventures), Chris Gardner (Underscore VC), and more. Save $450 and tap into real talk, sharp insights, and connections that drive growth. TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more. © 2024 Yahoo."},
{"source": "TechCrunch", "title": "Only 2 exhibitor tables up for grabs at TechCrunch All Stage — claim by June 29", "link": "https://techcrunch.com/2025/06/27/only-2-exhibitor-tables-up-for-grabs-at-techcrunch-all-stage-claim-by-june-29/", "pub_date": "2025-06-27T13:15:00-07:00", "description": "This is not a drill. If your startup exists to power the growth of other startups or is the kind of innovation tech leaders need to see firsthand, your moment is now. hits Boston’s SoWa Power Station on July 15 — and just remain. Yes, only two, and only until June 29. Tables for TC All Stage have been flying, and this is truly your last chance to claim your place in front of founders and investors across all stages. All exhibiting startups receive the following perks — and more. For the complete breakdown, check out the . Reserve your table in minutes — no approvals, no wait. Just , register, and it’s yours. This isn’t the time to hesitate. You clicked into this article because you it’s time to showcase your brand and make an impact. . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Samsung Unpacked 2025 live updates: Galaxy S25, new AI features, and more", "link": "https://techcrunch.com/storyline/samsung-unpacked-2025-live-updates-galaxy-s25-new-ai-features-and-more/", "pub_date": null, "description": "Adobe has noted that the new Galaxy S25 line will be the first handsets aimed at labeling AI-generated content. The Coalition for Content Provenance and Authenticity (C2PA) group — of which Samsung is now officially a part — describes the standard as a “nutrition label for digital content.” The information presented includes how the content was generated and edited, as well as whether any generative AI technologies were used in the process. , its smart home platform, will introduce AI features that allow users to simplify their everyday life through ambient sensing technology and generative AI. By using advanced sensor technology and sound sensor devices in users’ homes, Samsung says it will be able to understand their daily activities and create the ideal environment. For example, SmartThings could detect if a user is exercising and coach the person on their form, or turn on an air purifier after sensing the person’s dog jumping onto the couch. There’s more to come from . Stay up to date with the latest announcements Google is introducing a slew of Android updates, including key updates to its AI assistant, Gemini. Users that can perform multiple actions across different apps with just a single prompt. For instance, if you’re looking for a restaurant nearby and want to share the options with someone, Gemini can utilize Google Maps to generate recommendations and then compose a message to send via Google Messages. Additionally, Samsung introduced new features for Gemini Live, like the ability to practice a presentation while receiving immediate spoken feedback, as well as uploading files into the conversation, making Gemini Live more multimodal and context-aware. Google announced a pair of accessibility improvements for Android , including improvements to the screen reader and improved hearing aid functionality. , which delivers features like hands-free calling and lower latency connections. People who use braille will be able to access HID (human interface design), which will “make it easier to use a braille display across operating systems and different types of hardware.” For more reveals out of , stay up to date with the stream below. Google to make it easier for users to find information and get things done. The feature allows people to search from anywhere on their phone by using gestures like circling, highlighting, scribbling, or tapping. Google is now expanding AI Overviews to more kinds of visual results for places, trending images, unique objects, and more with Circle to Search. If you’re at a museum and see an interesting piece of art, for example, you can circle it to get an AI snapshot of helpful information about the piece. Google says Circle to Search will also be able to recognize numbers, email addresses, and URLs you see on your screen. Samsung announced for . As it continues to focus more efforts on mobile AI, Samsung is making it easier to access Google Gemini with the press of a button. Gemini can now be activated with a long press of the device’s side button, signaling the end days of quick Home and Bixby access. at the link below. Samsung announced the latest additions to its flagship Galaxy S smartphone lineup at Samsung Unpacked 2025. , with a 6.9-inch display and quartet of rear-facing cameras: a 50-megapixel ultra-wide, 200-megapixel wide, and a pair of telephoto lenses, with 3x and 5x optical zoom, respectively. The defining characteristic of the Galaxy S25, S25+, and S25 Ultra is the company’s continued All three S25 models are up for preorder today, with shipping starting February 7. For more announcements, with us It’s January, which means it’s time for Samsung to follow the sprint that was with its first big phone event of the year — , which will feature the reveal of the Samsung Galaxy S25 phone lineup. But as was the case last year, and is all but certain to be the case again this year, it wouldn’t be a hardware event without a whole bunch of AI. As our hardware editor Brian Heater predicted: “Galaxy AI will, of course, be the centerpiece as Samsung looks not only to present itself as a leader in the category, but also differentiate its offering from Google Gemini features that will be available across Android devices. Of course, last year’s big AI announcement was , a Google feature that launched on the S24 first. “Other possible — but significantly less certain — reveals include a successor to the lukewarmly received Galaxy Ring wearable and a closer look at , an extended reality headset being jointly developed with Google.” , kicking off at 10 a.m. PT / 1 p.m. ET, via the embed below. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Alphabet earnings live updates: AI, Gemini 2.0, Google Cloud, and more", "link": "https://techcrunch.com/storyline/alphabet-earnings-live-updates-ai-gemini-2-0-google-cloud-and-more/", "pub_date": null, "description": "DeepSeek last week based on speculation that its would dramatically decrease Big Tech’s spending on things like data centers and GPUs. But Alphabet has in doubling down on AI spending, pledging to spend $75 billion on capital expenditures this year to accelerate its AI ambitions — well over of $59 billion. “We are confident about the opportunities ahead, and to accelerate our progress, we expect to invest approximately $75 billion in capital expenditures in 2025,” CEO Sundar Pichai said during the company’s . , according to Reuters, so the new number represents a huge 42% increase. Both Meta and Alphabet are betting that cheaper AI will massively boost demand for their services, rather than making it basically free for everyone and threatening their business models. While Alphabet CEO Sundar Pichai praised DeepSeek in the company’s latest earnings call, he says Google Gemini has models that are just as efficient. “First of all, you know, I think it’s a tremendous team. I think they’ve done very, very good work,” Pichai said about DeepSeek. But he then added that are “some of the most efficient models out there, including comparing to DeepSeek’s V3 and R1.” Pichai argued that the rise of cheaper AI globally would only increase its adoption and that Google was well set up to benefit thanks to its billions of users. Meta CEO Mark Zuckerberg made in Meta’s earnings call last week. Sundar Pichai said that Google has a lot more innovations to Search coming this year, specifically, making the product more interactive. “I think as you make search… As you make it more easy for people to interact and ask follow-up questions, etc, I think we have an opportunity to drive further growth.” Sounds like Google Search is becoming more like an AI chatbot! The company said Google Search was up overall year-over-year while Search’s AI Overviews were popular with “younger” users. When asked how Google Search will evolve around AI, Alphabet CEO Sundar Pichai asked everyone to look to some of DeepMind’s research projects around multimodal AI and agents. “I think we’ll continue bringing AI in more powerful ways, in multimodal ways, things like what we’ve done with Lens, Circle to Search. You can imagine the future with Project Astra. You can also imagine areas like we have done in Gemini Deep Research.” That means, one day, Google Search might be able to process live video with , or generate long research reports with . The earnings call is off, and they’re talking about AI first. CEO Sundar Pichai says that Gemini 2.0 Flash, which first rolled out in the Gemini app, is rolling out to developers and customers tomorrow. He also says to expect “other model updates” tomorrow, telling everyone to “stay tuned.” Perhaps that’s Gemini 2.0 Pro Experimental, which developers have in recent weeks. The so far is that Google Cloud brought in $11.96 billion in revenue during the last quarter, missing analyst estimates of $12.19 billion. As we noted below, Google has seen major growth in its Cloud division during the AI boom. The disappointing Cloud revenue could mean that AI companies are choosing Microsoft or AWS for cloud workloads, or that the AI industry more broadly is slowing down spending on compute. Either way, not a good sign for Google. Just a few hours ago, from its AI principles webpage. Keep an eye out for any mentions of military contracts or work with governments on the earnings call. Alphabet will report its fourth-quarter earnings once the market closes, and analysts seem to be quite positive on the stock. 15 out of 19 analysts have issued “buy” or equivalent ratings and predict a price target of roughly $219. That could set Alphabet on track to close For more context, our friends at Yahoo Finance post-earnings over the past two and a half years. Everyone will be watching Google’s AI efforts today. Google stunned investors and analysts during its last earnings by posting an impressive boost to its cloud business, largely driving by AI companies buying its computing power and cloud services. Microsoft and AWS have , which have grown quite popular in the last month, and it’ll be interesting to see if Google Cloud does the same. Otherwise, we’ll be looking for any hints around Google DeepMind’s homegrown AI models, such as , or any updates around Keep an eye out on Google’s earnings call for questions about into the search giant. The investigation was announced on Monday night, just hours after President Donald Trump imposed a 10% tariff on Chinese goods. This seems to be part of China’s broader retaliation effort to Trump’s tariffs, in which it’s targeting several large U.S. companies. The search giant has a fairly limited presence in China; Google Search is blocked there, and , according to Reuters. That said, a China probe creates new legal headaches for Google, and complicates the company’s political relationship with the Trump administration. Google parent company Alphabet is reporting its fourth-quarter earnings today after the closing bell. The stock has been over the past month as investors grew bullish over Google’s AI investment, including the release of with multimodel features and its quantum computing chip, . Expect the company to be questioned on how these efforts will ultimately pay off to have an impact on Alphabet’s ROI, particularly in the wake of . Alphabet investors also typically want to know about Google’s cloud computing business and Google’s ads business — both of which are also affected by AI. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Rob Biederman will help founders rethink how to scale at TechCrunch All Stage 2025", "link": "https://techcrunch.com/2025/06/27/at-techcrunch-all-stage-2025-rob-biederman-will-help-founders-rethink-how-to-scale/", "pub_date": "2025-06-27T16:40:11-07:00", "description": "If you’re a founder looking to grow your startup, chances are you’re wrestling with more than just product or capital. Talent, scale, and smart execution are the real battlegrounds. That’s exactly what is built to address on July 15 at Boston’s SoWa Power Station. , managing partner at and one of the sharpest minds in talent, tech, and scaling strategy, will share his insights in a roundtable session. This is THE place where you can ask him directly what it takes to scale. to share honest insights, hands-on strategies, and lessons learned in the trenches. As a special surprise as we get closer to the event, we’re launching a limited-time 60% or more discount on two passes. That brings Founder Passes to $155, Investor Passes down to just $250, and students still get a chance to attend for just $99. to learn how to secure VC funding, recruit the right early hires, manage founder finances, navigate the messy middle of growth at all stages of scaling, and more. Simply put, he’s built solutions where most startups get stuck and is set on sharing those fixes to those in need. Before launching Asymmetric, Biederman co-founded , where he spent eight years as co-CEO, turning the company into the market leader for on-demand, high-skill talent. Today, Catalant powers how major companies deploy workforces, connecting them with more than 70,000 consultants and 1,000 boutique firms. He now serves as chairman of Catalant, is the co-author of “ ,” and teaches scaling technology ventures at Harvard Business School, where he’s an executive fellow. In short, Biederman doesn’t just talk about scale — he teaches it, builds it, and funds it. With a background that includes private equity at Goldman Sachs and Bain Capital, and a Harvard MBA earned with Baker Scholar honors, Biederman brings both operational experience and investment discipline to every conversation. At , Biederman will break down what most founders overlook when it comes to scaling: how to evolve your thinking about talent, execution, and long-term growth. isn’t just another startup conference — it’s a strategy session for people building real companies. You’ll walk away with tools, frameworks, and stories from top operators who’ve scaled beyond the early-stage maze. And Biederman’s insights on hiring, leadership, and operational leverage could easily reshape how you think about growth. TC All Stage tickets at these low rates are going fast, and there is limited seating available in the sessions, so it’s time to and be in the room where seeds can scale and startups go IPO. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Tesla earnings live updates: Promising ‘return to growth’ and cheaper cars", "link": "https://techcrunch.com/storyline/tesla-earnings-live-updates-elon-new-evs-ai-and-more/", "pub_date": null, "description": "As I look back over my notes from the Tesla Q4 earnings call, it’s worth noting how apolitical it was, especially considering Elon Musk’s current position inside the beltway. When asked about President Trump’s position on EVs — which includes ending all incentives to encourage sales — Musk took a neutral tone and talked around the question. “At this point, I think that sustainable transport is inevitable,” he said. “I’m highly confident that all transport will be autonomous electric, including aircraft, and that it simply can’t be stopped any more than one could have stopped the advent of the external combustion engine, steam engine, or one could have stopped the advent of the internal combustion engine.” In the one-hour call, Trump’s name came up twice — and not by Musk. Tesla’s Q4 earnings call is over, and Elon Musk and other executives touched on a lot of subjects, including battery packs being a constraint to work through in 2025, Optimus taking on boring jobs in Tesla factories, and the company intending to launch a in Austin this coming June. Oh, and yup — if you have a hardware 3 vehicle and want to fully unlock FSD, you’re going to need a hardware upgrade. The call is over, and the song “Soft Words” by Ben Fox fades in the background. Until next time … Tesla hopes to launch Supervised FSD in China this year, but Musk said getting the tech ready for that “gigantic market” has been a challenge. “They won’t currently allow us to transfer training video outside of China, and then the U.S. government won’t let us do training in China, so we’re in a bit of a bind there,” Musk said. Tesla’s solution? To feed publicly available videos of China’s streets — complete with street signs and traffic rules — into Tesla’s FSD training and simulator. Wut? I will not get into the whole thing here — that’s why I wrote this last October — but Tesla once was working on a $25,000 car to be built on the same next-gen platform that will power the upcoming Cybercab. That changed, and now Tesla is working on mysterious new models that will be built on existing production lines and will likely cost more than $30,000. Tesla has been saying, including in today’s shareholder letter, that those new models “remain on track for start of production in the first half of 2025.” But then CFO Vaibhav Taneja very clearly said on the call that the company is launching “a more affordable model in the first half of 2025” — clearly using the singular. We’d ask Tesla’s press team to clear this up, but Musk disbanded it years ago. Tesla CEO Elon Musk was asked during the call if so-called hardware 3 vehicles with FSD (the advanced driver-assistance system) would require a hardware upgrade. That question matters because hardware 4 vehicles have a faster FSD computer compared to hardware 3 and Elon has repeatedly said an upgrade wouldn’t be required to unlock the full, and frequently updated, FSD software. Welp … things change. “I mean, I think the honest answer is that we’re going to have to upgrade people’s hardware three computer for those that have bought full self-driving and that is the honest answer,” he said. “And that’s going to be painful and difficult, but we’ll get it done now. I’m kind of glad that not that many people bought the FSD package.” CFO Vaibhav Taneja said in his remarks that the “imposition of tariffs” is “very likely” and “will have an impact on our business and profitability” in 2025. Musk’s buddy President Trump has threatened a wide range of tariffs on imports from China, Canada, and Mexico. Musk said the company expects to “close the loop with Optimus” this year and will use the robot internally at Tesla. “We obviously can easily use several thousand human robots at Tesla for, you know, the most boring, annoying tasks in the factory, like the task nobody wants to do, where we have to, like, beg people to do this task,” he said. Tesla CFO Vaibhav Taneja noted that the automaker’s net income in Q4 was “impacted by a $600 million market benefit from bitcoin due to the adoption of a new accounting standard for digital assets.” He said that Tesla would adjust its other income in future reporting periods going forward. It’s worth noting that in 2023, Tesla recorded a on its bitcoin holdings. Times have changed. Remember that time Musk said you could with bitcoin? Musk noted during Tesla’s earnings call that the company aspires to ramp production of by “an order of magnitude” per year. But first, Tesla needs an entirely new supply chain for its “entirely new technology.” Musk said there was nothing off the shelf to use to build the Optimus. “We tried desperately with Optimus to use any existing motors, any actuators, sensors — nothing worked for a human robot hand at any price. We had to design everything from physics first principles.” He said the Optimus robotic hand will be able to play the piano or thread a needle. Our collective eyebrows rose when Elon Musk said self-driving vehicles were coming to Austin this week. Yes, really. Here is senior reporter detailing Musk’s claims, which he made during Tesla’s Q4 earnings call. TL;DR: Musk said his company will launch a paid ride-hailing robotaxi service in Austin, Texas, this coming June, the latest in a long line of sky-high promises he has yet to meet about autonomy. After making his typical bullish opening — “self-driving wolf,” “epic,” and “ridiculous” — Musk turned to some reality. Namely, constraints on growth. Musk said the biggest constraint in 2025 is battery packs. “We’re working on addressing that constraint, and I think we will make progress on addressing that constraint, and then things are really going to go ballistic next year, and really ballistic in ’27 and ’28,” Musk said Wednesday during a webcast after earnings. The call has started and Musk has maybe the most jittery energy I can recall on one of these earnings calls. In the span of a few minutes he: Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TechCrunch Disrupt 2025", "link": "https://techcrunch.com/events/tc-disrupt-2025/", "pub_date": null, "description": "From idea to IPO, Disrupt 2025 will map out the path for startups to achieve their next major milestone. Looking to meet founders, connect with investors, seek advice, or land your next big role? Disrupt is the must-attend event to make it all happen in person. Disrupt is more than a startup launchpad — it’s a growth accelerator. Dive into sessions on scaling, sales, and leadership, and connect with the investors and tech experts who can help take your business to the next level. Tap into the wisdom of founders and tech titans at Disrupt. From actionable tips to hard-won lessons, they’ll share what works (and what doesn’t) to guide you as you build your own path forward. Find the ticket type that fits you best with up to $675 savings. Groups can save up to 30%. TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more. From seed to Series C and beyond, on brings together the entire startup ecosystem. Learn from experts like Charles Hudson (Precursor Ventures), Jahanvi Sardana (Index Ventures), Chris Gardner (Underscore VC), and more. Save $450 and tap into real talk, sharp insights, and connections that drive growth. TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more. © 2024 Yahoo."},
{"source": "TechCrunch", "title": "TechCrunch All Stage 2025", "link": "https://techcrunch.com/events/techcrunch-all-stage-2025/", "pub_date": null, "description": "Wondering how to nail that pitch meeting and raise VC funding? Or how to build a high-octane sales team? What about recruiting early team members who will fuel future growth? Managing the finances of a new company while also wondering about your own personal finances as a founder? Legal? Marketing? PR? Being a great leader? Fidelity is powering TechCrunch All Stage to answer every one of these questions. Sign up for event updates to be in the know when the agenda drops. Hear from accomplished startup leaders in panel-led breakout sessions as they reveal the secrets to their success. These main-stage sessions offer unparalleled access to the journeys, insights, and tips that can help take your startup to the next level. Participate in immersive sessions where startup pioneers and peers come together to discuss challenges, share stories, and build connections that drive success. Expand your network, connect with founders, share insights, and form valuable relationships that inspire growth through networking opportunities. More speakers to come. Check back in to see agenda updates. We will reach out to you if your topic is selected. TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. If you’re interested in learning more about how your company can be part of the event, get in touch with our sales team below. Gain valuable experience assisting the TechCrunch Events Team. All volunteers receive a free event ticket to enjoy TechCrunch All Stage before or after their shift. Choose your ticket and dive into actionable strategies every founder needs. From seed to Series C and beyond, on brings together the entire startup ecosystem. Learn from experts like Charles Hudson (Precursor Ventures), Jahanvi Sardana (Index Ventures), Chris Gardner (Underscore VC), and more. Save $450 and tap into real talk, sharp insights, and connections that drive growth. TechCrunch offers many ways for partners to engage directly with our attendees before, during, and after the event. Get in touch with us to learn more. © 2024 Yahoo."},
{"source": "TechCrunch", "title": "Nvidia GTC 2025 live updates: Blackwell Ultra, GM partnerships, and two ‘personal AI supercomputers’", "link": "https://techcrunch.com/storyline/nvidia-gtc-2025-live-updates-blackwell-ultra-gm-partnerships-and-two-personal-ai-supercomputers/", "pub_date": null, "description": "it’s partnering with EPRI, a power industry R&D organization, to use AI to solve problems facing the electrical grid. Perhaps ironically, the issues are largely caused by rising power demand . The Open Power AI Consortium, which includes a number of electrical utilities and tech companies, it will use domain-specific AI models to devise new ways to tackle problems that the power industry is predicted to face in the coming years. The models will be open sourced and available to researchers across academia and industry. The power industry is facing in the United States and elsewhere as AI ramps up the need for computing power. Electricity demand is expected to grow by 4% annually in the coming years, to the International Energy Agency, nearly double over 2023 figures. In January 2025, Jensen Huang quantum computing stocks to crash after saying he believed quantum technology wouldn’t be very useful for the next 15 to 30 years. Huang is now making amends by launching Nvidia’s first , where he’s moderating a panel with CEOs from some of the same quantum computing companies whose stocks plummeted. In his opening speech, Huang said he never intended to trigger a crash with his remarks — in fact, he had no idea there were public quantum companies to begin with. “When I made that comment, apparently the whole industry’s stock went down 60%,” he said. “And my first reaction was, ‘I didn’t know they were public!’ How could a quantum computer company be public? I discovered they were public companies — I’m very happy for them.” Huang added that he thinks quantum computing holds “extraordinary” promise and noted that Nvidia was built on a similarly long timeline of decades of research and development. This week, Nvidia that it plans to build a new center in Boston to advance the development of quantum computing architectures and algorithms. Rivian founder and CEO RJ Scaringe was interviewed by Nvidia’s VP of automotive Rishi Dhall during GTC on Wednesday. As one might expect, the bulk of the conversation centered around GPUs used for training and simulation and at the edge — in this case, a Rivian vehicle. Toward the end of the talk, Dhall asked Scaringe a series of rapid-fire questions, including “Name one futuristic AI feature you wish Rivian … could develop tomorrow,” and “What’s one AI-powered feature that you wish Rivian and vehicles had right now, but isn’t possible yet?” Scaringe’s answer in both cases? “Self-driving,” although Scaringe added that self-driving isn’t impossible and it’s just a matter of time until it’s achieved and that Rivian has spent considerable time laying the foundation to get there. Last year, Rivian rolled out that allowed the company to launch a of its driver-assistance system for highway driving. The new hands-free feature handles the control steering, acceleration, and braking under certain conditions and locations, but it’s not considered a “Level 4” fully autonomous system. Noam Brown, who leads AI reasoning research at OpenAI, says certain forms of “reasoning” AI models could’ve arrived 20 years earlier had researchers “known [the right] approach” and algorithms. “There were various reasons why this research direction was neglected,” Brown said during a panel at in San Jose on Wednesday. “I noticed over the course of my research that, OK, there’s something missing. Humans spend a lot of time thinking before they act in a tough situation. Maybe this would be very useful [in AI].” Brown was referring to his work on game-playing AI at Carnegie Mellon University, including Pluribus, which defeated elite human professionals at poker. The AI Brown helped create was unique at the time in the sense that it “reasoned” through problems rather than attempting a more brute-force approach. Nvidia CEO Jensen Huang is speaking at a Q&A for the press at GTC. And he’s pretty tired, the billionaire CEO admitted. “I’m running low on blood sugar. I think I’ve had 100 calories of food over the past two days,” he said after asking for a Diet Coke, or some other caffeinated drink, onstage. Huang also poked fun at some reporters for asking him overly long and technical questions, answering one with a blunt “Yes.” He answered another question about base dies — a central semiconductor component — with a droll comment: “There’s no press release necessary for that optimization.” In the midst of GTC, Nvidia has acquired synthetic data startup Gretel. Terms of the acquisition are unknown. The price tag was said to be nine figures, exceeding Gretel’s most recent valuation of $320 million, . San Diego-based Gretel was by Alex Watson, Laszlo Bock, John Myers, and Ali Golshan, who also serves as the company’s CEO. The startup fine-tunes models, adds proprietary tech on top, and then packages these models together to sell them. Nvidia’s acquisition is strategic — and timely. Tech giants like Microsoft, Meta, OpenAI, and Anthropic are already using synthetic data to train flagship AI models as they . is here in San Jose showcasing its humanoid robot for the home, Neo Gamma. The robot has been vacuuming and watering plants at the convention center where GTC is being held, albeit not autonomously. While 1X says that it’s building in-house AI models to power Neo Gamma’s movements and speech, the robot currently relies on humans to teleoperate it today. Even with teleoperation, the robot isn’t perfect. Neo Gamma dropped a vacuum a few times on Wednesday. At one point, it started shaking, and then collapsed, only to be caught by 1X’s co-founder, Bernt Børnich. A 1X employee told us the robot was experiencing Wi-Fi issues in the crowded demo hall. The sweater it’s wearing looks amazing, though. A senior research scientist at DeepMind who worked on robotics and AI has left Google to create his own robotics startup, called , and it has already obtained investment from Nvidia. Former DeepMind employee Pete Florence as co-founder and CEO of Generalist AI at a panel at Nvidia’s GTC conference in San Jose on Tuesday. The panel showcased portfolio companies of Nvidia’s VC arm, NVentures. “We are largely still in stealth,” Florence told TechCrunch, explaining that the mission of his startup is “to make general-purpose robots a reality.” Florence joins a string of other DeepMind alums who have founded their own companies, like autonomous coding startup , biotech startup , , and others. Nvidia declined to comment. For more on Generalist AI and what it does, . Nvidia-backed says it has created a new benchmark to measure an AI model’s reasoning capabilities — and it’s based on the classic Japanese game of Sudoku. The new benchmark, called Modern Sudoku, “really is perfect” for measuring reasoning capabilities, said Sakana’s CTO Llion Jones during a presentation at GTC. Sudoku is a good way to measure reasoning for a number of reasons, including that it requires very creative long-term reasoning and that vision models aren’t powerful enough to solve Sudoku puzzles yet, Jones said. Sakana has made bold AI claims that didn’t quite pan out before. It that its latest model could dramatically speed up training. It also claimed an AI-generated paper passed peer review, although the In previous years, autonomous vehicles played a larger role in Nvidia CEO Jensen Huang’s GTC keynote — a reflection of where the technology stood in the hype cycle at the time. But just because talk of AVs has been supplanted by AI, Nvidia is still very much in the business. A slew of automated driving deals were announced at the company’s GTC conference in San Jose, including with startups like Gatik, as well as Torc and General Motors. Lucky for you we have a that explains exactly what these companies are getting from Nvidia. In an , Nvidia CEO Jensen Huang claimed that the Trump administration’s tariffs won’t do “significant damage” in the short run. “We’ve got a lot of AI to build,” he told the publication. “AI is the foundation, the operating system of every industry going forward. … We are enthusiastic about building in America. Partners are working with us to bring manufacturing here.” Nvidia’s chips are largely fabricated by chipmaker TSMC, which is based in Taiwan. That hasn’t allayed that future, reciprocal tariffs may impact parts of the company’s business, however. TSMC to spend “at least” $100 billion on U.S. chip facilities over the next four years. Nvidia is to develop Newton, a physics engine to simulate robotic movements in real-world settings, Nvidia CEO Jensen Huang announced at GTC 2025 on Tuesday. Disney will be among the first to use Newton to power its next-generation entertainment robots, like the Star Wars-inspired BDX droids — one of which waddled onstage next to Huang during his Tuesday keynote. Nvidia plans to release an early, open source version of Newton later in 2025. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "SXSW 2025 live coverage: Health tips from Bryan Johnson, concerns about Elon Musk, and what it’s like to actually ride a Waymo Uber on the conference’s final day", "link": "https://techcrunch.com/storyline/sxsw-2025-live-coverage-health-tips-from-bryan-johnson-concerns-about-elon-musk-and-what-its-like-to-actually-ride-a-waymo-uber-on-the-conferences-final-day/", "pub_date": null, "description": "Folks, it’s time to hit the dusty trail and leave Austin and SXSW 2025 behind. The official conference ended Thursday evening and the music festival, which lasts another two nights, took over. We marked the end of the conference with some tacos and Billboard’s The Stage at SXSW with headliner Koe Wetzel. Tech had a lighter footprint at the conference this year, particularly in the exhibition hall. But we still found lots of founders, some investors, interesting onstage interviews, and Bluesky Jay Graber’s cheeky wardrobe choice that called for Not to mention lots of robotaxis. On the transportation beat, , made the biggest splash. But AI was the real star, at least in terms of stage time. AI popped up in every conversation — on stage and off — from sports and entertainment to enterprise, social media, and urban development. The messaging fell squarely in the with a few folks like and issuing sterner warnings of the risks from AI. See y’all next year. At SXSW, Tern AI for TechCrunch that its low-cost alternative to GPS could “derive a position from nothing” — “No triangulation, no satellites, no Wi-Fi, nothing.” All Tern’s intelligent system uses is a cocktail of cached map information and a vehicle’s existing sensor data. “Your GPS cannot initialize position without that triangulation process, and so we think it’s a rather important innovation to be able to determine position organically within the vehicle,” Brett Harrison, co-founder and president, told TechCrunch. “[Tern] turns all these vehicles that you see into creators and originators of position information instead of consumers of it.” Our most critical systems, from aviation to disaster response to precision farming, rely on GPS. Foreign adversaries have already demonstrated that they can spoof GPS signals, which could have catastrophic impacts both on the economy and national security. Which makes finding alternatives all the more important. Read more about Tern AI’s mission and my demo with the Austin-based startup’s tech! In the same way that genome sequencing determines the genetic makeup of an organism, Bryan Johnson — the investor and founder behind the movement — wants to start “foodome” sequencing. “We’re going to sequence the U.S. ‘foodome,’ which means test 20% of foods that constitute 80% of the American diet based on stuff we eat everyday,” Johnson said Thursday at SXSW. Johnson is the founder and former CEO of Kernel, a brain monitoring device company, founder of OS Fund, and founder and former CEO of e-commerce company Braintree. “I want to be real with you, it’s just very, very hard to buy clean food,” he said, noting that most foods from grocery stores, even the organic brands, could have toxins in them from the way the food was processed. His goal is to test all of the food and create a public database where people can donate money to have certain foods and brands tested for toxins like heavy metals or microplastics, and then use the results to hold brands accountable for unsafe food practices. The launched in Austin a week before SXSW and it’s been a challenge actually matching with one. In Phoenix, San Francisco, and Los Angeles, consumers use the Waymo One app to hail a ride. And it’s always a robotaxi. Here in Austin, consumers use the Uber app and sometimes they’re matched with a robotaxi. Usually they get a human driver. Waymo helped TechCrunch coordinate a robotaxi ride. And that was fine and all, but we wanted an experience that was less orchestrated. We got lucky Thursday morning and were matched. The drive itself was uneventful, although the route was longer than what Google Maps suggested (I always compare). Waymo told me that the vehicles were being routed around certain areas, which may explain the difference. We did notice some new stuff though. Namely, the user interface, which includes the two displays inside the vehicle that shows the robotaxi and its surroundings. Waymo confirmed the updates and noted that these occur continuously. Here’s what we spotted. The display now shows the turn signals, hazards, and brake lights of vehicles in front of, and around, the robotaxi. Waymo now colors pedestrians, cyclists, and parked vehicles differently and the display highlights the destination building as the rider arrives at their drop off point. Finally, the Waymo display shows stop signs and traffic cones. Kirsten and I turned our tech brains off for a couple of hours to treat ourselves to a film, and I gotta say, “The Rivals of Amziah King” is THE PERFECT SXSW film. The movie, which is the first film Matthew McConaughey has been in in six years, has a healthy dose of Southern charm, strong themes of honor culture, heartwarming comedy, and a constant current of live bluegrass music that is so soulful, it’ll challenge anyone who claims they don’t like country. It also received a . And, welp, that doesn’t happen every day. I almost don’t want to tell you anything else about this film. I went in blind, and I was enthralled by every unexpected plot turn and camera angles. All you need to know is, everyone in that theater laughed, cried, jumped, and tapped their feet to the music. I have a newfound respect for both bees and the humble mandolin. The former director of Twitter’s machine ethics team about Elon Musk and his Department of Government Efficiency onstage at SXSW on Thursday. “When your funding is frozen and you don’t know if you’re gonna be fired, and there’s this, like, absolutely unhinged person saying weird things on the internet constantly, you still have to do your job, right?” Chowdhury said. “The lights have to be kept on because Elon Musk is not the one keeping the lights on, even though he would like you to think that.” Chowdhury said she fears the brain drain resulting from the dramatic reductions and chaotic management style. We’re here for the final day of the SXSW conference, which means the tech talks will end and the music goes to 11. We will bid adieu by tonight, but first let’s catch up on a bit of tech. The exhibition hall within the Austin Convention Center was light on tech. Really, light on tech. In years past, the hall was brimming with startups. This year, I found them in the installations and activations outside of the convention center, including Midwest House, Ireland House, and Funded House. Oh, and of course the parties too. Founders were out and about — and looking for funding. There were delegations of founders too, coming from Europe, Australia, and Brazil. Notably, I didn’t encounter much chatter of dual-use or defense startups. Although that might have been due to circumstances — SXSW tends to spread out. Quantum computing has been having a moment at SXSW with several talks on Wednesday and today. Plus, Marc Maron, the comedian whose podcast “WTF with Marc Maron,” receives over 80 million listeners per year, on a lot of topics, including an earnest exclamation that the podcast will never get into video. And we managed to get matched with a Waymo robotaxi with the Uber app. Hooray. More on that in a moment. Remember that I mentioned yesterday? Well, we’ve got some more details on that now. The city officially opened applications for grants to incentivize AI startups to move to downtown San Jose. There are three $50,000 grants on offer and another for $25,000 to AI companies at any stage that are looking to create a presence in the city. Bonus points if the startup focuses on civic problems for social good. “We have seen a growing narrative that the Bay Area is a tough place to do business,” San Jose mayor Matt Mahan told TechCrunch. “People are worried about the high cost of living, the lack of affordable housing, and have a lot of concern about whether or not they should start a company in the Bay Area, and we want to take on those concerns head-on.” Singer, songwriter, and leader of Creedence Clearwater Revival (CCR) John Fogerty is apparently keeping up with the times. During on Wednesday in Austin, Texas, the musician joked about using ChatGPT to determine which songs to play for his shows. In an interview conducted by Tom Morello (of Rage Against the Machine and Audioslave), Fogerty was asked how he decided on a setlist for a given evening, like his concert at SXSW the previous night. “I just go on ChatGPT or whatever,” Fogerty said, leading the audience to howl with laughter. He then added that “you learn a whole lot trying to be an entertainer,” and said he just wanted people to have fun at the concert. “I want them to join in. I want them to sing along.” The interview also touched on CCR history, music publishing rights, and the stories behind some of the band’s songs, among other things. At one point, Fogerty also pointed out how the medium we use to consume music defines how it’s presented. “Songs have always sort of been manifested by the medium that they’re on. I mean, the three-minute song or so was invented because of the 78 record. You just couldn’t put more stuff in there,” he said. Then the LP came along and CDs, which led to people having albums with far more songs, even 19- or 21-track albums.” (He said he didn’t think this was a great idea, for what it’s worth, adding that “after six or seven songs, put it on the next record!”) Today, the medium we use to consume music is streaming, which means that distribution is in some ways more democratic, Morello said, although there’s less of a funnel as thousands of new songs are released daily. CCR has over a billion streams, however, which Fogerty said was “magical and remarkable.” “If your song is streamed, especially to a great degree, it means that young people are listening to it, because that’s their media: streaming,” he said. I just moderated my second panel at SXSW: Engineering Joyrides with Gretchen Effgen (director of global automotive partnerships at Google), Pankaj Kedia (VP of commercial partnerships at Dolby), and Alan Wexler (SVP of strategy and innovation at GM). It was a lively discussion about what in-car entertainment looks like today and what it’ll be in the future, as more cars develop autonomous capabilities. The talk followed some news from the three companies. that its electric Cadillac OPTIQ and VISTIQ will feature Dolby Atmos immersive sound, available through Amazon Music. It’s the start of a larger rollout of Dolby’s system as a standard feature in certain 2025 and 2026 Cadillac models, and will be available across Cadillac’s entire 2026 EV lineup. The Optiq and other GM vehicles will also have Google built in, meaning they’ll come with Google features like Maps, Assistant, Play, and personalized suggestions. With the software-defined vehicle, cars have the potential to become your living room on wheels. But how will automakers balance cool tech offerings with distracting feature bloat? How much is improving our lives (like Dolby’s sound system), and how much is just frustrating (like everything controlled by a touchscreen)? Charina Chou, COO of , argued for government investment in the quantum computing market, arguing that no company could develop the technology successfully on its own. “The transistor … was funded by U.S. government fundamental research investments in science,” Chou explained while at the SXSW conference in Austin on Wednesday. “That is what has given rise even to a lot of the advances we have in quantum computing today — it’s all based on basic science … No one company is going to do this on their own. No one team can do it on their own. You’ve got to have a whole community of researchers. And government investment in this is critical,” she said. In addition, Chou pointed out that China is currently outspending the U.S. two to one on quantum research. Not only would that mean the U.S. could fall behind in critical areas, but there’s also the potential that quantum computing could break the encryption that today protects secure communications. “It’s important to note that that’s expected to take a computer that is one or two orders of magnitude more powerful than that would be required for chemistry materials, so it is farther down the road, but you can imagine that has massive national security implications,” Chou said. “And you would want the U.S. to have that capability.” Chou also talked about the broader potential for quantum computing, the types of problems it could solve, and other mysteries and misunderstandings about the technology. She pointed to possibilities like cancer drug testing, creating a mathematical model of a cell; breaking encryption; building better batteries and solar cells; helping solve the climate crises; optimizing anything from shipping routes to investments, fusion energy, more efficient energy use, and more. “If you took home just one message, it would be that quantum computers are capable of solving problems that are impossible for AI or supercomputers,” Chou said. Ireland’s (prime minister) Micheál Martin made a splash at SXSW with an onstage interview and a visit to — an activation organized by Enterprise Ireland, IDA Ireland, the Department of Foreign Affairs, and the national agency for Irish film Fís Éireann. I happened to be at Ireland House and interviewing Enterprise Ireland’s new CEO Kevin Sherry, when the Taoiseach came to meet with startup founders and folks in the film industry. His SXSW stop is part of a whirlwind tour that includes a visit to the White House. This morning, the Taoiseach attended a St. Patrick’s Day breakfast at Vice President J.D. Vance’s residence and is expected to meet with President Trump. The tour comes at a critical time for Ireland, a small country of about 5 million people that ranks sixth globally for foreign direct investment in the United States. Taoiseach Martin spoke about the economic relationship between the U.S. and Ireland while onstage at SXSW; it’s a relationship that could be affected by the reciprocal trade tariffs that the Trump administration is directing toward the EU, of which Ireland is a member. The Taoiseach’s stopover at Ireland House focused on founders and film, not politics. And many of those founders are connected to Enterprise Ireland, a government agency that supports the development of Irish-owned companies into new markets, including the U.S. Enterprise Ireland is no slouch either. Sherry told me the agency has a fund that invests in between 150 and 180 early-stage startups each year. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Tesla earnings wrap up: Elon Musk talks DOGE, Trump and tariffs, robotaxis, AI, and cheap EVs", "link": "https://techcrunch.com/storyline/tesla-q1-earnings-live-updates/", "pub_date": null, "description": "Thanks for joining our live updates. Here’s a quick rundown. Tesla missed earnings expectations with profits in the first quarter coming than the same period last year. And yet, stocks didn’t fall. They rose in after-hours trading. Why? CEO Elon Musk did the one thing investors have been asking — pleading — with him to do and turn his attention back to Tesla. Sort of. Musk is as long as President Trump will have him. But he will reduce his time with DOGE, which has slashed thousands of government jobs and gutted entire federal agencies. Starting in May, he will cut his DOGe time to a “day or two” per week. Musk said he will allocate this newly gained time to Tesla. Stocks moved higher after his comments. During the earnings call, Musk also attempted to thread the political needle on supporting President Trump while , stayed committed to launching a robotaxi service in Austin, made , and said a cheaper EV would go into production in June. . Elon referenced a post he reposted on X that said something to the effect of “any country that cannot manufacture its own drones is doomed to be the vassal state of any country that can.” And, per Musk, “America cannot currently manufacture its own drones.” The comment was made in response to an analyst question about whether the U.S. or China was further ahead on the development of physical AI, specifically humanoids and drones. Musk noted that China makes 70% of all drones and anyone else has a dependency on China’s supply chain. Tesla doesn’t make drones, but it does make humanoids. And despite the fact that Chinese humanoid robots are already attempting to (albeit not too successfully), have been deployed publicly and industrially at scale, and have strong government support, Musk said that there’s no company in any country that can match Tesla. “Now, I’m a little concerned that on the leaderboard, ranks two through 10 will be Chinese companies, but I’m confident that rank one will be Tesla,” he said. Elon stood by President Trump during the earnings call. But when you pay close attention to how he talked about tariffs, it’s clear there is some disagreement. After noting he was one of many advisors to President Trump and is not the president, Musk struck a measured and diplomatic how-do-I-thread-the-political-needle tone. Musk said he is hopeful Trump “will observe whether my predictions on tariffs are more accurate than others, and perhaps weigh my advice differently in the future.” Musk then stated he is an advocate of “predictable tariff structures,” and generally supports “free trade and lower tariffs.” The company is still debating how many Tesla robotaxis — and reminder not Cybercabs — will be in its when it launches this June in Austin. Musk didn’t seem too settled on the number, exclaiming it might be 10 to 20 vehicles on “day one” of the service. From here, he said the fleet “would scale it up rapidly after that.” More than an hour into the call – the usual cutoff for these things – we are now finally getting some questions from analysts who’ve been waiting on the phone. The first question is a mostly glowing one from Pierre Ferragu comparing Tesla to the iPhone and the competition to the flip-phone makers. Musk says it was obvious to him at the time that smartphones were the future. But he also says “the reality is that, in the future, most people are not going to buy cars.” Elon joked (a couple of times) that Waymo cars cost “way mo’ money” because they require lidar and radar, in addition to cameras, to operate autonomously. Tesla wants to drive autonomously with only cameras, but it has yet to achieve full self-driving capabilities. The goal is to get there soon with better AI and a whole lotta compute power. And that may work out for Tesla. It also may not. Either way, Musk said that “I don’t see anyone being able to compete with Tesla at present,” despite the fact that Waymo is already commercially operating in four cities with plans for several more, and Tesla is commercially operating in zero cities. Again, Musk is hanging his hat on Tesla’s promise to achieve autonomy with its current sensor suite of cameras and an end-to-end neural network approach that has been trained on billions of examples of real-world data. Then Teslas in the land will be able to turn into robotaxis with nothing but a software update. No mention though about all of the Tesla vehicles that will require a to achieve that goal. We’re almost an hour into this call and so far the only questions that have been asked have been the shareholder-submitted ones – and almost all of them have been already answered. Not one question from the analysts waiting on the phone yet. In keeping with his longstanding pattern of “refusing to learn any lessons from the way things have been done before,” Musk just admitted on the call that he thinks it’s “increasingly likely that there will be a localized parameter set” for Tesla’s upcoming robotaxi service. He waxed on about how human drivers can be good in California, but bad in New York snow, and so Tesla is looking at setting these “parameters” – he didn’t define them – for different places. There is a term for this already: Operational Design Domains. And it’s how Waymo (and other AV companies) have been approaching the problem of self-driving vehicles for years. Musk has spent years claiming Tesla will come up with a general self-driving solution that will work everywhere, but once again he seems to be changing his tune. Musk said we would see “millions of Teslas operating fully autonomously” in the second half of “next year.” Sound familiar? It’s because it is! Elon has promised that Tesla would achieve “next year” for at least a decade. Later, he pulled out another oft-repeated autonomy promise. And it involves sleep. “So, you know, the acid test being you should be able to go to sleep in your car and wake your destination,” he said. “And I’m confident that will be available in many cities in the U.S. by the end of this year.” Tesla is doing a cheap EV! No, wait, it’s not, it’s doing a Cybercab! Got whiplash? Same. As of today, Tesla says it will start production of a more affordable EV this June. This is the first time Tesla has noted the month for start of production. “To summarize, we have near term challenges in our business due to tariffs and bad image,” Taneja said. “Fitting our strategy of providing the best product at a competitive price is going to be a winner, and this is the reason we still focus on bringing cheaper models to market.” Taneja said that the adoption of a “new market standard” for Bitcoin is leading to increased volatility in Tesla’s “other income” section of its balance sheet. Tesla recorded negative $119 million in “other income”, compared to positive $595 million in Q4 2024. This isn’t the first time Tesla has lost money on Bitcoin. In , Tesla recorded a $204 million loss in Bitcoin holdings. Also throwback: Remember that time Musk said you could with bitcoin? Elon Musk made some big promises on the Optimus robots. “We expect to have thousands of Optimus robots working in Tesla factories by the end of this year,” Musk said. “And we expect to scale Optimus faster than any product I think in history to get to millions of units per year as soon as possible.” Per Tesla’s shareholder presentation, the automaker is on track to build Optimus at its Fremont pilot production line this year. He then noted he feels confident in getting to a million bots per year in less than five years, “maybe four years.” You heard it here first! Start the clock. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "TechCrunch All Stage 2025: Prepare 4 VC’s Jason Kraus will instruct on how to turn chaos into momentum", "link": "https://techcrunch.com/2025/06/27/techcrunch-all-stage-2025-prepare-4-vcs-jason-kraus-will-instruct-on-how-to-turn-chaos-into-momentum/", "pub_date": "2025-06-27T09:05:55-07:00", "description": "Being a founder often feels like you’re building the plane midflight. You’re juggling fundraising, product-market fit, marketing strategy, hiring — while quietly wondering if you’re even doing it right. , which is happening on July 15 at the SoWa Power Station in Boston, is built to answer those questions. Whether you’re pitching VCs, recruiting a killer team, or trying to make sense of your startup’s finances (and your own), All Stage offers actionable insights from people who’ve lived it. Expect main-stage conversations, deep-dive workshops, and tactical networking designed to help you scale with confidence. One of the voices you’ll want to hear from is Jason Kraus, founder of and one of the most committed startup ecosystem builders out there. And there’s a fresh bonus for new attendees. If you sign up during our limited-time offer, . Both of those are more than 60% off their standard prices, ! Plus, students can still attend for just $99. Because he’s made a career out of helping founders break through. Kraus launched his first company in college, and he’s never looked back. Through Prepare 4 VC, he’s worked with thousands of early-stage entrepreneurs across the globe, helping them sharpen their pitch, validate their market, and get investor-ready. He’s also a partner at the and , where he helps founders explore new, often overlooked funding pathways. But Kraus’ impact goes beyond capital strategy. He’s the engine behind founder communities like , , and the , and he built the Breakthrough Program, a 10-week journey that helps founders get past execution bottlenecks and build real traction. In short: Kraus knows how to turn early-stage chaos into momentum. His book “ ” captures hard-won lessons from the startup trenches, and his approach is always founder-first. Kraus’ session at All Stage will give you a tactical playbook for navigating early-stage challenges. Whether you’re figuring out your positioning, trying to impress investors, or just need help getting out of your own head — this is a conversation you’ll want a seat for. is where ambitious founders go to find direction, community, and game-changing insight. Our steep, limited discounts won’t last forever, though, and they’re moving fast. and lock in your spot to hear from Kraus and other top startup minds today! Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Meta buys over 1 GW of renewables to power its data centers", "link": "https://techcrunch.com/2025/06/27/meta-buys-over-1-gw-of-renewables-to-power-its-data-centers/", "pub_date": "2025-06-27T09:02:09-07:00", "description": "Meta bolstered its already considerable renewable power portfolio this week with a string of deals that added over 1 gigawatt of generating capacity. The social media company announced Thursday it will buy 791 megawatts of solar and wind power in Ohio, Arkansas, and Texas from project developer Invenergy. And on Wednesday, Meta said it would buy the environmental attributes from two of Adapture Renewables’ solar farms in Texas, totaling 360 megawatts. The various projects are expected to come online in 2027 and 2028. Meta has been on a renewable buying spree. Last month, it signed a deal to across two solar projects being built by AES, a utility and power-generation company. Earlier this month, the tech company inked a deal with XGS Energy to build a in New Mexico. The deals give renewables a boost at a time when subsidies for the technologies are in the reconciliation bills being hashed out by House and Senate Republicans. Solar power, in particular, is the fastest way for data centers to acquire new power today. A typical solar farm can be completed in , with phased construction allowing some to provide electrons even sooner than that. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Petlibro’s new smart camera uses AI to describe your pet’s movements, and it’s adorable", "link": "https://techcrunch.com/2025/06/27/petlibros-new-smart-camera-uses-ai-to-describe-your-pets-movements-and-its-adorable/", "pub_date": "2025-06-27T09:51:35-07:00", "description": ", the pet tech startup known for its automatic feeders and , has just launched its latest product, the AI-powered , designed to provide pet owners with real-time insights into their furbabies’ activities and behaviors. Scout is similar to other pet cameras on the market; it monitors your pet in real time and features two-way audio, allowing you to communicate with them if they’re getting into mischief. The allows users to control the camera’s movements, although the camera is also designed to detect and automatically follow their pet as they move past it. It can also make a chirping noise to grab their attention if you can’t find them. What sets this device apart, however, is its AI capabilities. Scout uses pet-recognition technology to track various activities, such as when your pet eats (which is helpful if they chew on things they shouldn’t), drinks water, uses the litter box, or simply walks in front of the screen. It also captures surprise selfies of your pet when they are detected and provides daily highlights, storing clips in the cloud for up to 30 days. Additionally, Scout can recognize multiple pets, allowing it to track their activities separately. Users can currently set individual profiles for two pets in the app. “Early on, our models struggled to tell similar-looking pets apart, which we knew was needed in many multi-pet pet households. Traditional facial recognition failed when pets moved quickly or shared features. This led us to develop a dynamic, first-of-its-kind (for an AI pet cam), feedback-driven system that improves through real-world use over time,” York Wu, founder and CEO, told TechCrunch. A standout feature I appreciated as a pet owner is that the device doesn’t just notify you of your pet’s activities; it also provides cute descriptions. One of my favorites during testing was, “Zelda is calmly strolling across the shiny floor, her nose pointed forward as she explores her surroundings with gentle curiosity.” How adorable is that? Another way Petlibro’s Scout camera stands out is its ability to share devices with up to five other family members and friends. If you’re interested in trying the device, it’s priced at $100. There are multiple subscription plans available; however, to access the AI features, you can opt for either the standard tier, which costs $12 per month, or the premium tier, priced at $17 per month. Another pet camera company, Furbo, offers a similar device that includes an AI “Nanny” assistant for $7 per month. The camera itself is priced at $210. While Petlibro’s Scout camera is priced lower than Furbo’s, it currently lacks a key feature found in Furbo’s offering: the ability to detect and alert owners to barking. Petlibro is actively working on adding this, along with meowing detection, which may broaden its appeal, as Furbo is primarily marketed to dog owners. Additionally, the Scout device doesn’t have a food dispenser, but Petlibro plans to integrate AI capabilities with select feeders and fountains, aiming to differentiate its growing product line from competitors. It should be noted that the company’s privacy policy indicates that its system collects image and video data captured by the camera for use in improving the device, including its AI features. Other smart cameras, such as and , also state in their privacy policies that they collect user data to improve their services. Scout doesn’t use audio in any AI training or processing. Petlibro explained to us that the data collection is for making corrections for users’ individual cameras. The data is handled in accordance with privacy laws. “Essentially, users are training their own camera with their pets, so the more they use it, the better it will get. For example, if I tell Scout in the app, they tagged this puppy as Max but it’s really Penny, it improves future accuracy,” a company spokesperson explained to us, adding that the app also includes a “donate video” button, allowing users to provide clips to Petlibro for “universal improvement,” they added. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "OpenAI hires team behind AI recommendation startup Crossing Minds", "link": "https://techcrunch.com/2025/06/27/openai-hires-team-behind-ai-recommendation-startup-crossing-minds/", "pub_date": "2025-06-27T04:25:13-07:00", "description": ", a startup that provides AI recommendation systems to e-commerce businesses, said on Thursday that its team is joining OpenAI. The startup was backed by Index Ventures, Shopify, Plug and Play, and Radical Ventures, and had raised more than $13.5 million across multiple rounds, according to Crunchbase. Crossing Minds largely worked with e-commerce companies to improve their personalization and recommendation systems. The company claims it studies customers’ on-site behavior data to gather insights on their shopping preferences without compromising privacy. “Joining OpenAI allows us to bring our work — and our values — into a mission we deeply respect: to ensure artificial general intelligence benefits all of humanity. We’re thrilled to bring our experience and energy to a team that’s setting the direction for the future of AI. We’re excited to learn, to contribute, and to help shape what’s next,” the startup’s co-founders wrote in a post on its website. Alexandre Robicquet, one of the Crossing Minds co-founders, has updated his , which now reads “Research, Post-training and Agents at OpenAI.” It is not clear if all of Crossing Minds’ team is joining OpenAI. Crossing Minds’ website also says that the company won’t take any more clients. Per , Crossing Minds previously said it was trusted by Intuit, Anthropic, Udacity, and Chanel. AI companies have built a plethora of tools to help customers shop. and have launched AI features to improve recommendations, while startups like Daydream have received to launch . Earlier this year, OpenAI updated ChatGPT to for items its users ask questions about. OpenAI didn’t immediately return a request for comment. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "German data protection official wants Apple, Google to remove DeepSeek from the country’s app stores", "link": "https://techcrunch.com/2025/06/27/germany-tells-apple-google-to-remove-deepseek-from-the-countrys-app-stores/", "pub_date": "2025-06-27T05:07:03-07:00", "description": "Posted: A German data protection official has reported Chinese AI app DeepSeek to Apple and Google, saying the app transfers users’ information to China illegally. Meike Kamp, Berlin’s commissioner for data protection and freedom of information, told the companies that DeepSeek did not provide “convincing evidence” that users’ data was protected as required by EU laws. “Chinese authorities have far-reaching access rights to personal data within the sphere of influence of Chinese companies,” Kamp , adding that the two tech firms must now review the report and decide whether to remove the app. Kamp said that her office had asked DeepSeek to comply with EU laws for transferring data outside the bloc or pull its app from the country, but the Chinese company did not do so. Italy earlier this year DeepSeek from app stores in the country, citing similar data protection concerns. Notably, two key details about DeepSeek that consumer privacy advocate groups in the EU highlighted are that the service is made in and operates out of China. Per its , this includes the information and data that DeepSeek collects and stores, which is also housed in its home country. Apple and Google did not immediately respond to requests for comment. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "David H. Rosmarin brings a founder-focused approach to anxiety at TechCrunch All Stage", "link": "https://techcrunch.com/2025/06/27/david-h-rosmarin-brings-a-founder-focused-approach-to-anxiety-at-techcrunch-all-stage/", "pub_date": "2025-06-27T07:00:00-07:00", "description": "Startups demand constant decision-making and pressure-filled pivots, which bring big emotional swings. It’s no wonder anxiety shows up at every stage. But what if it didn’t have to be a liability? At on July 15 at Boston’s SoWa Power Station, , clinical psychologist, author, and Harvard Medical School professor, will lead a refreshingly honest roundtable session that challenges how founders think about fear and pressure. His roundtable, isn’t about “overcoming” anxiety. It’s about using it as a strategic advantage. As founder of the and a nationally recognized mental health expert, Rosmarin has worked with executives, entrepreneurs, and high-performance teams across industries. In this session, he’ll guide attendees through a stigma-free, deeply practical conversation on how to turn anxiety into fuel, not friction. Expect takeaways on: With coverage in outlets like The New York Times, Wall Street Journal, GMA, and TED.com, Rosmarin’s work has reached millions. Now he’s bringing it directly to startup leaders. If you’re building under pressure (and who isn’t?), this session will change how you lead. Learn how to channel your anxiety into your greatest advantage, and get many other takeaways from a whole day packed with sessions with scaling experts at TC All Stage. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Meta in talks to acquire voice-cloning startup Play AI", "link": "https://techcrunch.com/2025/06/27/meta-in-talks-to-acquire-voice-cloning-startup-play-ai/", "pub_date": "2025-06-27T03:38:12-07:00", "description": "Posted: Alongside bolstering its AI research talent pool, Meta seems to be keen to flesh out its consumer-facing AI features. The company is in discussions to acquire a voice-cloning startup called Play AI, Bloomberg , citing anonymous sources. The tech giant aims to buy the startup’s tech and bring on board some of its staff, the report said. Play AI lets anyone clone different kinds of voices that they can use for AI-powered use cases, such as customer service, per its website. The startup has raised $23.5 million in total, and its investors include 500 Global, Kindred Ventures, Race Capital, and Soma Capital, per Crunchbase. Meta currently lets creators on its social platforms and has added chatbot. Acquiring a voice startup would let the company bake in audio features into its creative suite. Meta declined to comment on the story. Play AI did not immediately return a request for comment. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Startups Weekly: Tech and the law", "link": "https://techcrunch.com/2025/06/27/startups-weekly-tech-and-the-law/", "pub_date": "2025-06-27T10:05:00-07:00", "description": "Before this newsletter takes a break for the Fourth of July next week, here are the startup stories and funding rounds that caught our eye over the last few days, which have been quite busy. This week brought us lawsuit updates, M&As, and a combination of both. Data cybersecurity company Rubrik to accelerate the adoption of AI agents by its users. The startup, which helps companies fine-tune AI models, had raised some $28 million in venture capital. Deal amount wasn’t disclosed but was reportedly sizable. German startup Kadmos, which had raised $38 million in external capital for its salary payment platform for seafaring workers, as part of the Japanese shipping firm’s efforts to expand its fintech services. Embattled AI music startup Suno , a browser-based AI digital audio workstation, in a deal that actually happened a few months ago but that it chose to disclose on the heels of yet another copyright lawsuit. Getty Images , the startup behind AI image generator Stable Diffusion, but other lawsuits continue, both in the U.S. and in the U.K. Despite headwinds, Bill Gates-backed startup Airloom Energy is pressing on and in Wyoming. Another week, another $300 million round — sometimes at wildly different valuations, even for the same company. Meanwhile, the small deals keep things interesting, too. : Harvey AI raised co-led by Kleiner Perkins and Coatue. This comes only four months after Sequoia led a $300 million Series D at a $3 billion valuation into the AI-enabled legal tech startup, which is now valued at $5 billion. : Abridge, an AI startup automating medical notes, led by a16z at a $5.3 billion valuation. : Blockchain-based prediction market platform Kalshi , while rival Polymarket is reportedly working on closing a $200 million round at a pre-money valuation around $1 billion. : Finom, a challenger bank that targets SMBs across Europe, that comes in addition to the $105 million in growth funding it secured from General Catalyst’s Customer Value Fund a few weeks ago. : Indian drone startup Raphe mPhibr led by General Catalyst. Its customers include the Indian Army, Navy, and Air Force, as well as armed police forces. : AI-powered dictation app Wispr Flow that brought its total funding to $56 million. The company also earlier this month. : Novoloop, a startup that upcycles waste plastic, to finalize the design and begin the construction of its first commercial-scale plant. Eventual, a startup inspired by a data-processing problem its founders encountered at Lyft, within eight months. : Synthflow AI, a Berlin-based no-code platform that lets enterprises build and deploy customized white-label voice AI customer service agents, led by Accel. Better Auth, the third Ethiopian startup to graduate from YC, . Its open source framework promises to simplify how developers manage user authentication and has quickly become popular. Space startup Lux Aeterna with $4 million in pre-seed funding and the ambition to launch a reusable satellite in 2027. After a two-year break from public life, seasoned early-stage investor, entrepreneur, and author Brad Feld is back with his ninth book, “Give First.” TechCrunch . Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "Facebook is asking to use Meta AI on photos in your camera roll you haven’t yet shared", "link": "https://techcrunch.com/2025/06/27/facebook-is-asking-to-use-meta-ai-on-photos-in-your-camera-roll-you-havent-yet-shared/", "pub_date": "2025-06-27T11:31:38-07:00", "description": "Facebook is asking users for access to their phone’s camera roll to automatically suggest AI-edited versions of their photos — including ones that haven’t been uploaded to Facebook yet. The feature is being suggested to Facebook users when they’re creating a new Story on the social networking app. Here, a screen pops up and asks if the user will opt into “cloud processing” to allow creative suggestions. As the pop-up message explains, by clicking “Allow,” you’ll let Facebook generate new ideas from your camera roll, like collages, recaps, AI restylings, or photo themes. To work, Facebook says it will upload media from your camera roll to its cloud (meaning its servers) on an “ongoing basis,” based on information like time, location, or themes. The message also notes that only you can see the suggestions, and the media isn’t used for ad targeting. However, by tapping “Allow,” you are agreeing to . This allows your media and facial features to be analyzed by AI, it says. The company will additionally use the date and presence of people or objects in your photos to craft its creative ideas. The creative tool is another example of the slippery slope that comes with sharing our personal media with AI providers. Like other tech giants, Meta has grand AI ambitions. Being able to tap into the personal photos users haven’t yet shared on Facebook’s social network could give the company an advantage in the AI race. Unfortunately for end users, in tech companies’ rush to stay ahead, it’s not always clear what they’re agreeing to when features like this appear. According to Meta’s AI Terms around image processing, “once shared, you agree that Meta will analyze those images, including facial features, using AI. This processing allows us to offer innovative new features, including the ability to summarize image contents, modify images, and generate new content based on the image,” the text states. The same AI terms also give Meta’s AI the right to “retain and use” any personal information you’ve shared in order to personalize its AI outputs. The company notes that it can review your interactions with its AI, including conversations, and those reviews may be conducted by humans. The terms don’t define what Meta considers personal information, beyond saying it includes “information you submit as Prompts, Feedback, or other Content.” We have to wonder whether the photos you’ve shared for “cloud processing” also count here. So far, there hasn’t been much backlash about this feature. A handful of Facebook users have across the AI-generated photo suggestions when creating a new story and raised questions about it. For instance, found that Facebook had pulled up an old photo (in this case, one that had previously been shared to the social network) and automatically turned it into an anime using Meta AI. When another user in an anti-AI Facebook group , the search led to a section called camera roll sharing suggestions in the app’s Settings. We also found this feature under Facebook’s Settings, where it’s listed in the Preferences section. On the “Camera roll sharing suggestions” page, there are two toggles. The first lets Facebook suggest photos from your camera roll when browsing the app. The second (which should be opt-in based on the pop-up that requested permission in Stories) is where you could enable or disable the “cloud processing,” which lets Meta make AI images using your camera roll photos. This additional access to use AI on your camera roll’s photos does not appear to be new. We found posts from earlier this year where confused Facebook users were sharing screenshots of the pop-up message that appeared in their Stories section. Meta has also about the feature for both iOS and Android users. Meta’s AI terms have been enforceable as of June 23, 2024; we can’t compare the current AI terms with older versions because Meta doesn’t keep a record, and previously published terms haven’t been properly saved by the Internet Archive’s Wayback Machine. Since this feature dips into your camera roll, however, it extends beyond what Meta had previously announced, in terms of its AI on your publicly shared data, including posts and comments on Facebook and Instagram. (EU users had , to .) Reached for comment, Meta spokesperson Maria Cubeta confirmed the feature is a test, saying, “We’re exploring ways to make content sharing easier for people on Facebook by testing suggestions of ready-to-share and curated content from a person’s camera roll.” “These suggestions are opt-in only and only shown to you – unless you decide to share them – and can be turned off at any time,” she continued. “Camera roll media may be used to improve these suggestions, but are not used to improve AI models in this test.” The company is currently testing suggestions in the U.S. and Canada. Topics © 2025 TechCrunch Media LLC."},
{"source": "TechCrunch", "title": "SCOTUS porn ruling opens door to sweeping internet age verification", "link": "https://techcrunch.com/2025/06/27/scotus-porn-ruling-opens-door-to-sweeping-internet-age-verification/", "pub_date": "2025-06-27T08:36:37-07:00", "description": "The United States Supreme Court ruled Friday to uphold a Texas law requiring websites with “sexual material harmful to minors” to verify the ages of all visitors. The Free Speech Coalition (FSC), a trade association for the adult industry, had brought the lawsuit against Texas attorney general Ken Paxton challenging the state’s age verification law. “The power to require age verification is within a State’s authority to prevent children from accessing sexually explicit content,” Justice Clarence Thomas in the court opinion. The court sided 6-3 in Paxton’s favor, with Justices Elena Kagan, Sonia Sotomayor, and Ketanji Brown Jackson dissenting. Age verification in this context does not mean mindlessly clicking a box to declare that you are an adult — it means uploading government ID documents or using third-party verification platforms to prove your age. This decision has far-reaching ramifications for internet privacy. Eighteen states have requiring age verification to access such websites, while six additional states have passed legislation that has not yet taken effect. Under the Texas law that the FSC challenged, a pornographic website is defined as having at least one-third of its content deemed “harmful to minors.” Internet privacy advocates have long criticized these for their potential to compromise users’ digital security, even when verification companies vow not to retain identifying information. In some cases, these age checks are conducted via , and it’s for hackers to government databases. At a time when LGBTQ rights are in the U.S., activists have that laws like this could be used to classify non-pornographic information about the LGBTQ community, as well as basic sex education, to be “sexual material harmful to minors.” These concerns appear well-founded, given that President Trump’s administration has to civil rights movements and LGBTQ history from some government websites. The original Texas age verification law, HB 1181, was passed around the same time the state imposed other legal restrictions on the LGBTQ community, including and bans on for minors. The drag show law was later deemed unconstitutional for violating the First Amendment. “This ruling allows states to enact onerous age-verification rules that will block adults from accessing lawful speech, curtail their ability to be anonymous, and jeopardize their data security and privacy,” said Aaron Mackey, Free Speech and Transparency Litigation Director at the Electronic Frontier Foundation, in a statement. “These are real and immense burdens on adults, and the Court was wrong to ignore them in upholding Texas’ law.” Topics © 2025 TechCrunch Media LLC."}
]